[{"time": "07:30 - 08:30", "activities": [{"name_of_activity": "Registration & breakfast", "speaker_name": null, "room_number": null, "track_label": null, "url": null, "day_of_week": "Tuesday", "date": "2024/05/07", "time": "07:30 - 08:30", "description": null}]}, {"time": "08:30 - 09:30", "activities": [{"name_of_activity": "A Learning Mindset in the Age of Innovation (Overflow 1)", "speaker_name": "Katja Schipperheijn", "room_number": "Room 5", "track_label": "Motivational & self-improvement", "url": "https://techorama.be/agenda/session/a-learning-mindset-in-the-age-of-innovation-overflow-1/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "08:30 - 09:30", "description": "Unleash potential with a learning mindset supported by emerging innovations based on Katja's new book The Learning Mindset: Combining Human Competencies with Technology to Thrive.\n\nDeveloping a learning mindset is essential for success in a rapidly changing future of work. But how can you adopt this approach? What qualities do you need? What role do technology and neuroscience play? How can it foster innovation, problem-solving and collaboration?\n\nKatja will explain what a learning mindset is and why it is urgently needed to survive.  Among other things, she covers the competences needed for this approach, including curiosity, openess, imagination, realism and consilience. She will show how these traits can be developed in all people, while respecting their individual differences. In doing so, Katja does not shy away from difficult topics and points out the need to surround yourself with a diversity team as a learning leader and to give misfits their place.\n\nThis new keynote from an international learning expert also outlines how to foster social and lean learning among colleagues, how to become a learning leader and how a learning approach can turn challenges into opportunities. There is also an essential discussion on the neuroscience of learning, the evolution of artificial intelligence and how humans and technology can work together in symbiosis for the best results. The often-provocative keynote that leaves no one unprepared brings valuable insights, inspiration and practical guidance."}, {"name_of_activity": "A Learning Mindset in the Age of Innovation (Overflow 2)", "speaker_name": "Katja Schipperheijn", "room_number": "Room 6", "track_label": "Motivational & self-improvement", "url": "https://techorama.be/agenda/session/a-learning-mindset-in-the-age-of-innovation-overflow-2/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "08:30 - 09:30", "description": "Unleash potential with a learning mindset supported by emerging innovations based on Katja's new book The Learning Mindset: Combining Human Competencies with Technology to Thrive.\n\nDeveloping a learning mindset is essential for success in a rapidly changing future of work. But how can you adopt this approach? What qualities do you need? What role do technology and neuroscience play? How can it foster innovation, problem-solving and collaboration?\n\nKatja will explain what a learning mindset is and why it is urgently needed to survive.  Among other things, she covers the competences needed for this approach, including curiosity, openess, imagination, realism and consilience. She will show how these traits can be developed in all people, while respecting their individual differences. In doing so, Katja does not shy away from difficult topics and points out the need to surround yourself with a diversity team as a learning leader and to give misfits their place.\n\nThis new keynote from an international learning expert also outlines how to foster social and lean learning among colleagues, how to become a learning leader and how a learning approach can turn challenges into opportunities. There is also an essential discussion on the neuroscience of learning, the evolution of artificial intelligence and how humans and technology can work together in symbiosis for the best results. The often-provocative keynote that leaves no one unprepared brings valuable insights, inspiration and practical guidance."}, {"name_of_activity": "A Learning Mindset in the Age of Innovation", "speaker_name": "Katja Schipperheijn", "room_number": "Room 8", "track_label": "Motivational & self-improvement", "url": "https://techorama.be/agenda/session/a-learning-mindset-in-the-age-of-innovation/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "08:30 - 09:30", "description": "Unleash potential with a learning mindset supported by emerging innovations based on Katja's new book The Learning Mindset: Combining Human Competencies with Technology to Thrive.\n\nDeveloping a learning mindset is essential for success in a rapidly changing future of work. But how can you adopt this approach? What qualities do you need? What role do technology and neuroscience play? How can it foster innovation, problem-solving and collaboration?\n\nKatja will explain what a learning mindset is and why it is urgently needed to survive.  Among other things, she covers the competences needed for this approach, including curiosity, openess, imagination, realism and consilience. She will show how these traits can be developed in all people, while respecting their individual differences. In doing so, Katja does not shy away from difficult topics and points out the need to surround yourself with a diversity team as a learning leader and to give misfits their place.\n\nThis new keynote from an international learning expert also outlines how to foster social and lean learning among colleagues, how to become a learning leader and how a learning approach can turn challenges into opportunities. There is also an essential discussion on the neuroscience of learning, the evolution of artificial intelligence and how humans and technology can work together in symbiosis for the best results. The often-provocative keynote that leaves no one unprepared brings valuable insights, inspiration and practical guidance."}]}, {"time": "09:30 - 09:45", "activities": [{"name_of_activity": "Break", "speaker_name": null, "room_number": null, "track_label": null, "url": null, "day_of_week": "Tuesday", "date": "2024/05/07", "time": "09:30 - 09:45", "description": null}]}, {"time": "09:45 - 10:45", "activities": [{"name_of_activity": "Unleashing the Power of VDI for the DEV", "speaker_name": "Wim Matthyssen, Micha Wets", "room_number": "Room 1", "track_label": "Modern Workplace", "url": "https://techorama.be/agenda/session/unleashing-the-power-of-vdi-for-the-dev/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "09:45 - 10:45", "description": "These days, Microsoft offers a variety of VDI solutions that not only improve developers' experiences but, more importantly, remove the need to install development tools on personal or company-owned devices.\n \nIn this session, we'll explore the various Microsoft VDI possibilities, such as AVD and W365. But we'll also take a closer look at Microsoft Dev Box and discuss its potential to optimize your daily workflow as a developer.\n \nSo, join us to harness the power of VDI as a developer and redefine the way you code, collaborate, and innovate."}, {"name_of_activity": ".NET Configuration In Depth", "speaker_name": "Chris Ayers", "room_number": "Room 4", "track_label": "Architecture", "url": "https://techorama.be/agenda/session/net-configuration-in-depth/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "09:45 - 10:45", "description": "Working as a consultant, something I often saw was teams moving from .NET Framework to .NET Core and .NET 5/6. As they adopted these new versions, they kept similar patterns and libraries. The teams weren't taking full advantage of the improvements in .NET. One of those areas is Configuration.\n\nConfiguration holds our secrets, connection strings, application settings, and other data. We have checked it in, stored it in a web.config and transformed it in a pipeline. Today there are a variety of ways to configure our applications securely.\n\nThis session will cover:\nStrongly typed configuration\nConfiguration providers - JSON, XML, INI files; Environment variables; Command Line;Azure App Config; Key Vault\nDependency Injection\nThe Options Pattern"}, {"name_of_activity": "AI 101", "speaker_name": "Todd Klindt", "room_number": "Room 5", "track_label": "AI & IOT & ML", "url": "https://techorama.be/agenda/session/ai-101/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "09:45 - 10:45", "description": "Like 2023, 2024 is shaping up to be the year of Generative AI. Every news outlet is talking about, every industry is trying to implement it, and every politician is talking about how scary it is. We all know how to use AI, but what does it look like under the hood? In this session Todd will present an in-depth introduction to Generative AI. He'll cover terminology and talk about the technology behind AI apps. Training, prompts, installing local models, it's all here. If you want to take your AI game up another level, this session is the place to be."}, {"name_of_activity": "Developing Your Personal Brand", "speaker_name": "Jason Alba", "room_number": "Room 6", "track_label": "Motivational & self-improvement", "url": "https://techorama.be/agenda/session/developing-your-personal-brand/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "09:45 - 10:45", "description": "Creating and communicating your personal brand is an important career tactic that can help attract new opportunities and important relationships. In this session, Jason will give examples of personal branding for technologists and then show you steps to create your personal brand. He'll talk about simple ways to communicate your brand as well as long-lasting ways to make your brand stand out. "}, {"name_of_activity": "Where we're going... we don't need batch jobs", "speaker_name": "Adam Ralph", "room_number": "Room 7", "track_label": "Architecture", "url": "https://techorama.be/agenda/session/where-were-going-we-dont-need-batch-jobs/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "09:45 - 10:45", "description": "Ever write a batch job? Batch jobs are bits of code that periodically look at your database’s current or historic state and then act on it. They often run off-hours or in the middle of the night to avoid performance impact, and if they fail while processing, get ready for a pager alert. You can prevent this nightmare by telling your system what to do in the future! Look to the real world to model a long-running business process from start to finish.\n\nJoin me and learn:\n\n- The challenges with recurring batch jobs.\n- How to move a business process away from batch processing.\n- Real-world use cases for modelling future events."}, {"name_of_activity": "Building Cloud Native AI Apps with .NET 8", "speaker_name": "Scott Hunter", "room_number": "Room 8", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/building-cloud-native-ai-apps-with-net-8/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "09:45 - 10:45", "description": "Come learn all about the new .NET Aspire framework and how it enables cloud-native development with .NET 8. We will also cover Open AI and who to use it with your .NET 8 apps using Semantic Kernel and Azure Functions AI Bindings. We will run all of this on a containers that support PaaS (Platform as a Service) in the cloud. "}, {"name_of_activity": "Data Modeling and Partitioning Patterns in Azure Cosmos DB", "speaker_name": "Leonard Lobel", "room_number": "Room 9", "track_label": "Data Platform & BI", "url": "https://techorama.be/agenda/session/data-modeling-and-partitioning-patterns-in-azure-cosmos-db/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "09:45 - 10:45", "description": "For many newcomers to Cosmos DB, the learning process starts with data modeling and partitioning. How should you structure your model? When should you combine multiple entity types in a single container? Should you de-normalize your entities? What’s the best partition key for your data?\n\nIn this session, we discuss the key strategies for modeling and partitioning data effectively in Cosmos DB. Using a real-world NoSQL example based on the AdventureWorks relational database, we explore key Cosmos DB concepts—request units (RUs), partitioning, and data modeling—and how their understanding guides the path to a data model that yields the best performance and scalability. Attend this session, and acquire the critical skills you’ll need to design the optimal database for Cosmos DB."}, {"name_of_activity": "5 Common Platform Engineering Mistakes", "speaker_name": "Geert van der Cruijsen", "room_number": "Room 10", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/5-common-platform-engineering-mistakes/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "09:45 - 10:45", "description": "Platform engineering plays a critical role in making developers more productive and delivering business value while maintaining security and compliance. However, it's not uncommon for platform teams to become bottlenecks that impede progress rather than driving it forward.\n\nJoin us for this session as we explore the top 5 common mistakes in platform engineering that can lead to inefficiencies and bottlenecks. We'll examine practical strategies for avoiding these mistakes and building a high-performing engineering department that delivers results while ensuring security and compliance. Whether you're an experienced platform engineer, just starting out or a engineering working with a platform team, you'll leave this session with valuable insights for enhancing your Organization’s productivity and effectiveness."}, {"name_of_activity": "AppSec at Scale: What's new with GitHub Advanced Security", "speaker_name": "Colin Dembovsky", "room_number": "Room 11", "track_label": "Security", "url": "https://techorama.be/agenda/session/appsec-at-scale-whats-new-with-github-advanced-security/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "09:45 - 10:45", "description": "Application Security (AppSec) programs continue to be a challenge for most Enterprises. Developers and security professionals don't often see eye-to-eye and often use different tools and platforms, further isolating teams from one another.\nIn this session, Colin covers how GitHub Advanced Security is the only developer centric AppSec platform that both developers and security professionals love. We explore some of the newest features that allow AppSec programs to scale - from org-wide \"instant-on\" capabilities to AI-enhanced fixes."}, {"name_of_activity": "Are Rewrites always a Bad Idea?", "speaker_name": "Adele Carpenter", "room_number": "Room 13", "track_label": "Architecture", "url": "https://techorama.be/agenda/session/are-rewrites-always-a-bad-idea/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "09:45 - 10:45", "description": "It’s an age-old story. Dev meets legacy code base. Dev gets frustrated. Dev embarks on rewrite. Company spends money. Rewrite fails. Legacy stays in production.\n\nAsk most senior developers and they will tell you that a rewrite is rarely a good idea. And they’re right. But under what circumstances is a rewrite actually the best path forward?\n\nI faced this question with my team in a recent customer project. We were responsible for running and maintaining a service written by an academic in C++. The only problem? We are neither academics nor C++ developers. With the customer keen to add features to the ageing service, we asked ourselves, do we dare to rewrite?\n\nIn this talk I will share my experiences on this project, including what it was like to take my first steps into a leadership role simply because I knew the most math.\n\nUsing this project as a backdrop, this talk will cover\n\n- When a rewrite can be a good idea\n- Choosing the tech stack\n- Taking a leadership role as a junior dev\n- Geeky stuff from the domain: turning academia into code\n"}, {"name_of_activity": "The Fin-tastic Way to Boost Your Cloud ROI: An Introduction to FinOps on Azure", "speaker_name": "René van Osnabrugge", "room_number": "Room 14", "track_label": "Cloud Services", "url": "https://techorama.be/agenda/session/the-fintastic-way-to-boost-your-cloud-roi-an-introduction-to-finops-on-azure/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "09:45 - 10:45", "description": "Are you tired of overspending on cloud costs? Want to optimize your Azure spending and boost your ROI? Look no further than FinOps! In this session, we'll dive into the basics of FinOps and why it's becoming increasingly important for organizations of all sizes. We'll also explore the specific tools and features available on the Azure platform that can help you implement FinOps successfully, including cost management, budgeting, and optimization tools. \n\nWhether you're new to FinOps or have experience in the field, this session will provide valuable insights and practical tips for maximizing your cloud savings. So join me in this session and learn how to become a FinOps pro on Azure!"}]}, {"time": "10:45 - 11:15", "activities": [{"name_of_activity": "Break", "speaker_name": null, "room_number": null, "track_label": null, "url": null, "day_of_week": "Tuesday", "date": "2024/05/07", "time": "10:45 - 11:15", "description": null}]}, {"time": "11:15 - 12:15", "activities": [{"name_of_activity": "The (upgraded) YOLO-Driven Development Manifesto - 7 Amendments to DevOps", "speaker_name": "Tobias Mohr, Marlene Roth", "room_number": "Room 1", "track_label": "DevOps", "url": "https://techorama.be/agenda/session/the-upgraded-yolodriven-development-manifesto-7-amendments-to-devops/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "11:15 - 12:15", "description": "21 years after the creation of the manifesto for agile software development, which was intended to bring software development back into the spotlight, we have shifted our focus once again. Today, the software development industry is saturated with agile practices and DevOps methodologies.\n \nAs agile software development grows out of its infancy, rigidly structured frameworks are being pitched to CIOs, CTOs, and tech leaders as a cure-all solution. Innovative sales tactics combined with a lack of complete understanding have spawned a multitude of misconceptions and anti-patterns around DevOps. Inadvertently, rebellious counter-movements, exemplified by the YDD manifesto (andersoncardoso.github.io/ydd/), are the ironic response to this over-structuring.\n \nWe offer a balanced, experience-based approach that synergizes DevOps with foundational agile principles by advocating an updated YDD manifesto for practical but effective DevOps."}, {"name_of_activity": "Building Enterprise Blazor Apps Using CSLA .NET", "speaker_name": "Rockford Lhotka", "room_number": "Room 4", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/building-enterprise-blazor-apps-using-csla-net/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "11:15 - 12:15", "description": "Blazor is one of the most powerful UI technologies available today, allowing you to write apps that run on a web server, or directly on client devices in any modern browser by using WebAssembly.\n\nAn enterprise app probably calls back-end services and needs to interact with app servers. Some or all of your business logic may run on the client, the app server, or both. That's ideal for the balance between user interactivity, performance, scalability, and security. The widely-used open source CSLA .NET framework helps you create a reusable, scalable, and cross-platform portable business layer that lets your application run on multiple types of client devices while sharing business logic between the clients and your app server. This session is an end-to-end walkthrough of how this works and how you can benefit.\n\nLearning points:\n1. Learn how Blazor can be used to build end-user experiences for the enterprise\n2. Learn how CSLA .NET helps you develop maintainable, reusable, cross-platform business logic\n3. Learn how to leverage your business logic on the server with Linux containers"}, {"name_of_activity": "Microsoft Fabric for Dummies", "speaker_name": "Koen Verbeeck", "room_number": "Room 5", "track_label": "Data Platform & BI", "url": "https://techorama.be/agenda/session/microsoft-fabric-for-dummies/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "11:15 - 12:15", "description": "Microsoft Fabric is the new all-encompassing data platform of Microsoft. But there are so many components, services and features to learn, it seems overwhelming.\n\nIn this session, we take a step back and start from the beginning. We will cover the architectural overview of Fabric, its building blocks and which use cases are covered by this platform.\n\nAt the end, you should be able to assess if Fabric is the right choice for your environment."}, {"name_of_activity": "Developing Minimal Web APIs in .NET and Azure API Management", "speaker_name": "Jonah Andersson", "room_number": "Room 6", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/developing-minimal-web-apis-in-net-and-azure-api-management/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "11:15 - 12:15", "description": "In the software development, the more clean code you write the better. In certain business use cases, we as developers have to create Web APIs in .NET that are intended for microservices, integration and exposing our APIs to our consumers. \n\nIn this session, you will learn more about developing with Minimal Web APIs in C# .NET  with Microsoft Azure using API Management and more. Session with have a mix of important concepts to get you started and code demo to keep your brains so interested to get started! "}, {"name_of_activity": "Inside GPT – Large Language Models Demystified", "speaker_name": "Alan Smith", "room_number": "Room 7", "track_label": "AI & IOT & ML", "url": "https://techorama.be/agenda/session/inside-gpt-large-language-models-demystified/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "11:15 - 12:15", "description": "Natural language processing using generative pre-trained transformers (GPT) algorithms is a rapidly evolving field that offers many opportunities and challenges for application developers. But what is a generative pre-trained transformer, and how does it work? How can you leverage the latest advances in GPT algorithms to create engaging and useful applications? Can my business benefit from creating a GPT powered chat bot?\n\nIn this demo intensive session Alan will take a deep dive into the architecture of GPT algorithms and the inner workings of ChatGPT. The journey will begin by looking at the fundamental concepts of natural language processing, such as word embedding, vectorization and tokenization. He will then demonstrate how you can apply these techniques to train a GPT2 model that can generate song lyrics, showing the internals of how word sequences are predicted.\n\nAlan will then shift the focus to larger language models, such as ChatGPT and GPT4, demonstrating their power, capabilities, and limitations. The use of hyperparameters such as temperature and frequency penalty will be explained and their effect on the generated output demonstrated. He will then cover the concepts of prompt engineering and demonstrate how Retrieval Augmented Generation (RAG) patterns can be leveraged to create a ChatGPT experience based on your own textual data.\n\nJoin me for this session if you want to learn how to harness the power of GPT algorithms in your own solutions.\n"}, {"name_of_activity": "The Boeing 737 MAX: When Humans and Technology Don't Mix", "speaker_name": "Kyle Kotowick", "room_number": "Room 8", "track_label": "Motivational & self-improvement", "url": "https://techorama.be/agenda/session/the-boeing-737-max-when-humans-and-technology-dont-mix/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "11:15 - 12:15", "description": "In 2011, realizing it desperately needed to offer a competitive product to Airbus’ A320neo, Boeing embarked on a project to upgrade its legendary 737 aircraft to match the A320neo’s efficiency. Limited by the constraints of the 737’s original design and their desire to minimize training needed by pilots to fly the new aircraft, Boeing made multiple critical compromises in the aircraft’s design. 346 deaths and $87 billion later, we have all been reminded of the importance of rigorous design processes and the need to engineer systems for the realities of the end users and their environment. This talk dives into the motivations for the design compromises, the human factors considerations that were disregarded, and how a Fortune 100 company’s prioritization of profit over good design practice led to its stunning fall from grace. The lessons learned are directly applicable to all kinds of developers, from web designers to mission-critical infrastructure engineers."}, {"name_of_activity": "Open Source Contribution Made Easy with DevContainers", "speaker_name": "April Yoho", "room_number": "Room 9", "track_label": "Cloud Services", "url": "https://techorama.be/agenda/session/open-source-contribution-made-easy-with-devcontainers/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "11:15 - 12:15", "description": "The time to get started on any new project can often put the brakes on getting involved on an open source project. Getting started can be difficult, especially when you need to setup your machine with dependencies, extensions and packages. \n\nRemove the barriers for yourself, your project and anyone wanting to work or join in on your project by learning what a DevContainer is and how they're essential for every single repository. \n\nWe will cover off how to leverage the security and power of DevContainers so your projects can get started faster, allowing everyone to work with the same tooling. DevContainers embrace true Cloud Native capability. Whether you're working locally from your machine, or the cloud, we'll walk through the journey of setting up a DevContainer together."}, {"name_of_activity": "Protect yourself against supply chain attacks", "speaker_name": "Rob Bos", "room_number": "Room 10", "track_label": "Security", "url": "https://techorama.be/agenda/session/protect-yourself-against-supply-chain-attacks/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "11:15 - 12:15", "description": "As an industry, we are using third party packages and building components for lots of things. In this supply chain, there are lots of places for vulnerabilities. They can then be used to attack your DevOps pipelines! \n\nIn this session, I will go over some common attack examples and show you a way to prevent them from happening. There are frameworks available in the industry that guide you through the process of becoming more mature in protecting not only your source code and application but also the packages you use and the pipelines you build them with. I'll demo some of GitHub's features that help preventing these types of attacks"}, {"name_of_activity": "A lap around .NET on AWS", "speaker_name": "Alexander Dragunov", "room_number": "Room 11", "track_label": "Cloud Services", "url": "https://techorama.be/agenda/session/a-lap-around-net-on-aws/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "11:15 - 12:15", "description": "If you're a .NET developer looking to build on AWS, this demo-packed session is for you. We'll explore the AWS capabilities that every .NET developer should know, whether you're new to the cloud or ready to go deeper. You will learn how to easily migrate and modernize legacy .NET Framework applications, build serverless and containerized apps with .NET, implement infrastructure as code with C#, add AI/ML to your .NET application with .NET SDK and many more. And do everything without leaving your favorite IDEs such as Visual Studio, Visual Studio Code and JetBrains Rider."}, {"name_of_activity": "User Definied Functions – From SQL 2000 – SQL 2022", "speaker_name": "Uwe Ricken", "room_number": "Room 13", "track_label": "Data Platform & BI", "url": "https://techorama.be/agenda/session/user-definied-functions-from-sql-2000-sql-2022/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "11:15 - 12:15", "description": "User Definied Functions (UDF) came first with SQL Server 2000. While developers welcomed the introduction of these features, they became a DAB nightmare.\nThis session start with the very basics of User Definied Functions (SCALAR, MULTI-LINE, INLINE) and shows the problems of functions when they get used in queries.\nLots of improvements have been made since to speed up queries which are using UDF.\nThe second part of the session treat the great improvements of execution of functions and show ways to reach new records in the execution of your queries with UDFs.\n"}, {"name_of_activity": "Making sense of Microsoft 365 Guest & External access", "speaker_name": "Thomas Vochten", "room_number": "Room 14", "track_label": "Modern Workplace", "url": "https://techorama.be/agenda/session/making-sense-of-microsoft-365-guest-external-access/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "11:15 - 12:15", "description": "Microsoft 365 lets you work with external users in different apps and services. But managing these users can be hard, especially if you want to comply with your security and governance policies. In this session, you will see how to set up and control guest and external access in Microsoft 365. You will find out how to automate and track guest and external access scenarios, such as adding, deleting, or changing guests, applying conditional access and multi-factor authentication, and auditing guest actions and permissions. You will also learn how to fix common problems and how to use the newest features and updates for guest and external access.\n"}]}, {"time": "12:15 - 13:15", "activities": [{"name_of_activity": "Lunch", "speaker_name": null, "room_number": null, "track_label": null, "url": null, "day_of_week": "Tuesday", "date": "2024/05/07", "time": "12:15 - 13:15", "description": null}]}, {"time": "12:45 - 13:05", "activities": [{"name_of_activity": ".NET DevOps Revolution: Flexibility and Quality Control with Docker's Adaptive Arsenal", "speaker_name": "Wouter Bauchart", "room_number": "Room 8", "track_label": "DevOps", "url": "https://techorama.be/agenda/session/net-devops-revolution-flexibility-and-quality-control-with-dockers-adaptive-arsenal/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "12:45 - 13:05", "description": "\"It worked on my machine!\" is not only said at runtime. It is as easily said during application build! A well-known solution for this is to create a Docker container image of your application. But what if the application will be run in an environment not supporting containers with required unit and quality validation tests? Let's see together how we can achieve this by picking and customizing the interesting bits of the common .NET Dockerfile to our needs. We'll do this from a developer's view, making sure the least amount of management and after-care is required."}]}, {"time": "13:15 - 14:15", "activities": [{"name_of_activity": "GenAI Multi-agents: The New Frontier in Software Development", "speaker_name": "Jorge Garcia Ximenez, Pierre Malarme", "room_number": "Room 1", "track_label": "AI & IOT & ML", "url": "https://techorama.be/agenda/session/genai-multiagents-the-new-frontier-in-software-development/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "13:15 - 14:15", "description": "In the dynamic world of software development, the role of the developer is evolving from a software developer to a systems thinker, echoing the words of Thomas Dohmke, CEO at GitHub. This presentation delves into how Generative AI and multi-agent systems, particularly utilizing AutoGen, can significantly enhance a developer’s workflow, particularly in creating, testing, and deploying code automatically.\n\nWe explore how GenAI multi-agent systems are not just tools but active participants in the coding process. These agents converse and collaborate with each other, each with a specific role, such as developer, QA engineer, or IT engineer. They generate code, review it, build it, test it, and deploy it, effectively becoming an integral part of the DevOps team.\n\nFor instance, consider a scenario where data needs to be extracted from one schema, transformed and loaded to another one. The GenAI multi-agents, using the available business descriptions and data schema, could autonomously create and deploy an ETL pipeline to extract data from the source, transform it according to the requirements, and load it into the target database. Then it is reviewed by the developer and if accepted move to production.\n\nBy automating repetitive, boilerplate and uninteresting tasks, GenAI multi-agents act as a second pair of hands, freeing developers to focus on more intellectually stimulating challenges.\n\nJoin us as we journey into the future of software development, where GenAI and human ingenuity intersect to redefine what’s possible. We look forward to sharing a vision of a future where developers and AI work in tandem to create the innovative solutions of tomorrow."}, {"name_of_activity": "Choosing The Right AWS Service For Your .NET Website + API", "speaker_name": "François Bouteruche", "room_number": "Room 4", "track_label": "Cloud Services", "url": "https://techorama.be/agenda/session/choosing-the-right-aws-service-for-your-net-website-api/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "13:15 - 14:15", "description": "Have you ever been confused by the myriad of choices offered by AWS for hosting a website or an API?\n\nLambda, Elastic Beanstalk, Lightsail, AppRunner, Amplify, S3 (and more!) can each host websites + APIs. But which one should we choose?\n\nWhich one is cheapest? Which one is fastest? Which one will scale to meet our needs?\n\nJoin me in this session as we dive into each AWS hosting service to determine which one is best for your scenario and explain why!"}, {"name_of_activity": "SQL Server: Unleashing Query Performance", "speaker_name": "Pinal Dave", "room_number": "Room 5", "track_label": "Data Platform & BI", "url": "https://techorama.be/agenda/session/sql-server-unleashing-query-performance/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "13:15 - 14:15", "description": "Step into a world where SQL Server queries execute with lightning-fast precision. In this transformative session, we will dissect the common yet elusive issue of slow-running queries, revealing that the true adversary is often not the server itself but the code we craft. Through a mix of expert instruction and interactive learning, we’ll embark on a journey to identify and conquer the inefficiencies that bog down SQL Server performance.\n\nWe’ll arm you with the skills to sculpt queries that are not just functional but blisteringly fast. You’ll become adept at indexing, learning the ins and outs of how strategic index implementation can dramatically accelerate your data retrieval.\n\nTo keep the adrenaline high, we'll inject some fun into the mix with a live quiz that will challenge your understanding and encourage a lively exchange of ideas. This isn't just another lecture—it's a participatory experience designed to keep you engaged and entertained.\n\nBy the session's end, you'll be equipped with a toolkit of scripts and a wealth of insights ready to be deployed as soon as you return to your server environment. Prepare to leave with more than just knowledge—go with the power to immediately and profoundly impact your SQL Server's performance."}, {"name_of_activity": "Demystifying Azure Security for Developers", "speaker_name": "Kevin Dockx", "room_number": "Room 6", "track_label": "Security", "url": "https://techorama.be/agenda/session/demystifying-azure-security-for-developers/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "13:15 - 14:15", "description": "For a lot of us, Azure security is a bit of a black box.  Does something like \"Oh, ok, so the documentation says that if I click \"Enable managed identity\" here, it should secure my service, so let's do that\" sound familiar?  In that case:  have you ever wondered what that does beneath the covers?  How it is safe?  And... what's up with those user-assigned vs system-assigned managed identities?  And… what actually happens when you enable a front-end flow? And… how enabling access to an API exposes the API in a secure manner?  And much more.   \n\nThis rather theoretical yet enormously interesting ;-) session is for those of you who work with Azure, secure their applications with it and want to understand how all of that really works beneath the covers.\n"}, {"name_of_activity": "The Bleeding Edge of Angular", "speaker_name": "Lara Newsom", "room_number": "Room 7", "track_label": "Web & Frontend", "url": "https://techorama.be/agenda/session/the-bleeding-edge-of-angular/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "13:15 - 14:15", "description": "With new and bigger releases every six months, it can be a real challenge to keep up with what's new in Angular. In this talk, we will cover several of the most popular features from the past few releases, including Signals, Control Flow, Deferred Loading, and more!  "}, {"name_of_activity": "Updating Legacy Apps to Modern .NET", "speaker_name": "Jon Galloway", "room_number": "Room 8", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/updating-legacy-apps-to-modern-net/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "13:15 - 14:15", "description": "Sure, the shiny new release of .NET has lots of features and blazing performance, but they might seem out of reach when you spend a lot of time in a codebase that's... well, showing its years. We've got some great new tools to help you update your apps, based on real world customer apps. I'll show you how to get started, and share some experiences I've had in upgrading a few .NET production apps lately."}, {"name_of_activity": "The Mario Kart™ guide to building a career", "speaker_name": "Hannes Lowette", "room_number": "Room 9", "track_label": "Motivational & self-improvement", "url": "https://techorama.be/agenda/session/the-mario-kartt-guide-to-building-a-career/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "13:15 - 14:15", "description": "Mario Kart™ teaches us a lot of things: how to take shortcuts, how to stab your friends in the back, and most of all: how to get to the front of the pack. But have you ever stopped to wonder what lessons you can learn from it when it comes to planning for your own success?\n\nPersonally, I've had to overcome some obstacles to get to where I am today. And the things I have learned for myself, I have also applied as a coach at Axxes, where I have been involved in a lot of careers besides my own. Seeing other people grow has always been a key motivator for me in my role.\n\nA sure-fire road to success might not exist, but there are numerous lessons I've learned from doing this over the years. Those tips have been helpful to a lot of people, and I'll gladly share them with you.\n\nIn this session, I'll dive into building a career head-first. We'll use Mario Kart™ as a guideline and there will be anecdotes from my personal experience as a developer, a consultant and a coach. You'll walk away with some new ideas on how to handle your own career."}, {"name_of_activity": "Build invincible cloud-native apps using Dapr & Workflow", "speaker_name": "Paul Yuknewicz", "room_number": "Room 10", "track_label": "Cloud Services", "url": "https://techorama.be/agenda/session/build-invincible-cloudnative-apps-using-dapr-workflow/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "13:15 - 14:15", "description": "Remember when writing connected application code to do something innovative was the hard part? These days developers have to do more than ever, not only to write innovative and intelligent app code to run their business, but now also have to deal with all the faults, outages, disasters, hot spots, scale points, and concurrency issues that come with building distributed apps and microservices at scale. In this session, you will learn about the best practices to write distributed app code that sings at scale directly from a maintainer of Dapr (a CNCF incubation project) and the Azure team that delivered several hyper-scale cloud services in production. It will focus on the topics of resiliency, distributed locking, and optimization in common tasks like async messaging & Pub-Sub, state management, secrets and the latest Workflow API. You will also learn about abstractions and implementations to do this the easy way in your favorite programming model and language, while targeting either the Azure Container Service or Kubernetes."}, {"name_of_activity": "Optimizing Azure CosmosDB for Enterprise Applications", "speaker_name": "Glenn Colpaert", "room_number": "Room 11", "track_label": "Cloud Services", "url": "https://techorama.be/agenda/session/optimizing-azure-cosmosdb-for-enterprise-applications/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "13:15 - 14:15", "description": "Are you ready to delve into the world of Azure CosmosDB?\nIn this session we'll explore some common and best practices for running this globally distributed database in a production environment.\n\nFrom capacity planning to data modeling and monitoring, we'll cover all the key aspects you need to keep in mind to ensure your Azure CosmosDB deployment is a success. We'll also address common challenges and discuss strategies for handling data migration and disaster recovery.\n\nBy the end of this session, you will be able to confidently navigate Azure CosmosDB and use this globally distributed database in your own production environment. Just watch out for those killer data modeling decisions hiding in the underbrush!"}, {"name_of_activity": "Zero to Document Hero - Intro to MongoDB and .NET", "speaker_name": "Luce Carter", "room_number": "Room 13", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/zero-to-document-hero-intro-to-mongodb-and-net/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "13:15 - 14:15", "description": "Once upon a time, relational databases or RDMS (think SQL), was the only data store in town. But now there’s a competitor,  NoSQL which is a range of database types including document databases. \n\nIn this talk, you will learn about the basic differences between them, what MongoDB is, why document databases are so powerful, how MongoDB can be used with C# and some really cool uses cases that show databases can be cool ;).\n\nBy the end of the talk, you should walk away realising that SQL isn't the only way."}, {"name_of_activity": "Cultivating Productivity: The Definitive Guide to Building a Thriving Engineering Culture", "speaker_name": "Jennifer Wadella", "room_number": "Room 14", "track_label": "Motivational & self-improvement", "url": "https://techorama.be/agenda/session/cultivating-productivity-the-definitive-guide-to-building-a-thriving-engineering-culture/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "13:15 - 14:15", "description": "Having a thriving engineering culture isn't a matter of chance; it comes from a deliberate effort. Effective culture-building demands insightful management, vision, problem-solving abilities, and strong interpersonal skills. In this talk, I'll guide you through the process of cultivating a productive engineering culture. Whether you're a new manager looking for a blueprint or an experienced one seeking fresh insights, you'll leave with actionable checklists, proven strategies, and real-world examples to empower your team."}]}, {"time": "14:15 - 14:30", "activities": [{"name_of_activity": "Break", "speaker_name": null, "room_number": null, "track_label": null, "url": null, "day_of_week": "Tuesday", "date": "2024/05/07", "time": "14:15 - 14:30", "description": null}]}, {"time": "14:30 - 15:30", "activities": [{"name_of_activity": "OpenID Connect and OAuth 2.0 Primer", "speaker_name": "John Craddock", "room_number": "Room 1", "track_label": "Security", "url": "https://techorama.be/agenda/session/openid-connect-and-oauth-20-primer/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "14:30 - 15:30", "description": "Open ID Connect, and OAuth 2.0 are core cloud authentication and authorization protocols. Due to their flexibility in managing different application types and methods of obtaining tokens, gaining a clear understanding of the protocols can be highly challenging. Come to this session, and John Craddock will clearly and concisely explain the protocols and their use.\n\nThe session is deep-dive and packed with demos. John will show you his troubleshooting tips and tricks to make sure your apps are running to form. \n\nA highly recommended follow up to this session will be John's session on day 2 at 08:30: Entra ID App registrations – The good, bad and the ugly\n"}, {"name_of_activity": "Building your own Copilots with generative AI and the Semantic Kernel Framework", "speaker_name": "Jan Gezels, Hans Verbeeck", "room_number": "Room 4", "track_label": "AI & IOT & ML", "url": "https://techorama.be/agenda/session/building-your-own-copilots-with-generative-ai-and-the-semantic-kernel-framework/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "14:30 - 15:30", "description": "it has been over a year since OpenAI released ChatGPT to the world. In those 12 months, a lot has happened, and it would take us a lot more than an hour to cover it all... OpenAI and Microsoft have a strong partnership where Microsoft can leverage the OpenAI models to offer them in a lot of services and products. One of those is the Azure OpenAI service, which gives you the means to easily add generative AI to your solutions. Microsoft has been building copilots on top (and in) a lot of products and services that you know and use today.\n\nIn this session, Hans Verbeeck & myself will cover how you can leverage the same framework that Microsoft is using (Semantic Kernel) to build your own copilots AND how you can start extending your Copilots (and the ones of Microsoft) with publicly available and your own plugins. I truly believe that this is going to change how we build software and how end users are going to interact with it!"}, {"name_of_activity": "GPT-4 vs Starcraft II – Strategic Decision Making using Large Language Models", "speaker_name": "Alan Smith", "room_number": "Room 5", "track_label": "AI & IOT & ML", "url": "https://techorama.be/agenda/session/gpt4-vs-starcraft-ii-strategic-decision-making-using-large-language-models/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "14:30 - 15:30", "description": "Starcraft II requires complex strategy decisions to be made in real-time. Planning resources, building the optimal structures and units, when to upgrade and when to defend or attack will all be critical to the success in a game. Large language models, such as GPT-4, have shown impressive performance on various natural language tasks, such as text summarization, question answering, and text generation. But how well can they make strategic decisions in a dynamic and competitive environment?\n\nIn this demo intensive session Alan will explore the capabilities of large-language models for strategic decision making. He will explain the strategy decisions that need to be made in a Starcraft game, and what makes it an ideal scenario for exploring and evaluating the capabilities of GPT-4. Alan will then focus on the techniques for leveraging GPT models for strategic decision making, including prompt engineering and state description as well as parsing and understanding the response messages. He will also discuss different scenarios where large language models can be leveraged in strategic decision making.\n\nJoin me for this session if you want to learn more about using GPT models in strategic decision-making processes, or just sit back and watch GPT-4 destroy the Zerg.\n"}, {"name_of_activity": "Practical OpenTelemetry Instrumentation for .NET Applications", "speaker_name": "Steve Gordon", "room_number": "Room 6", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/practical-opentelemetry-instrumentation-for-net-applications/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "14:30 - 15:30", "description": "Are your .NET applications truly observable? Do you want to learn how to instrument your .NET applications using OpenTelemetry? If so, join Steve to learn from a real-world example.\n\nIn this session, Steve will introduce OpenTelemetry and the APIs we should use in .NET to instrument applications for distributed tracing. \n\nMost applications today focus on emitting logs. For richer observability, we need to go further. Distributed tracing provides greater context about how our applications function and provides insight across application boundaries, which is critical in modern microservice and cloud architectures.\n\nThis session focuses on the practicalities of instrumenting code and the decisions teams must make along the way. We'll focus on a worked example of instrumenting a library while discussing the choices and best practices to consider. We'll dive into the implementation details of the actual code and discuss our design choices.\n\nBeyond the code, we'll discuss formalising an approach to observability for tracing across teams and how to ensure consistent standards are applied.\n\nWhether you are new to OpenTelemetry or already familiar with the fundamental concepts, this session will guide you in the practical application of instrumentation techniques for your C# codebase."}, {"name_of_activity": "Real-time asset tracking with Azure: leveraging IoT, maps, and serverless technologies", "speaker_name": "Joonas Westlin", "room_number": "Room 7", "track_label": "Cloud Services", "url": "https://techorama.be/agenda/session/realtime-asset-tracking-with-azure-leveraging-iot-maps-and-serverless-technologies/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "14:30 - 15:30", "description": "Implementing high throughput event processing with Azure services presents many interesting challenges. A location tracking scenario adds its own challenges on top of those, such as dealing with coordinate systems and map services. Picking the right Azure services is important as is how they are configured and used.\n\nIn this talk we will look at a scenario that our team had to implement, the challenges it presented, and how we solved them using Azure services. We will go through a demo application that uses simulated GPS trackers and shows their real-time location on a map view. We will also look at possible optimizations and options.\n\nIn this talk we will look at the following Azure services: Event Hubs, Functions, SQL, Data Explorer, Maps, and SignalR Service."}, {"name_of_activity": "Productivity Tips and Tricks in Visual Studio", "speaker_name": "Leslie Richardson", "room_number": "Room 8", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/productivity-tips-and-tricks-in-visual-studio/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "14:30 - 15:30", "description": "Want to be more productive in Visual Studio? Check out this demo-heavy session to learn about new and existing tools, tips, and tricks to write, debug, and customize your code and overall workspace with ease in Visual Studio 2022!"}, {"name_of_activity": "Leadership and the Power of Regret: Turning Emotions into Action", "speaker_name": "Arthur Doler", "room_number": "Room 9", "track_label": "Motivational & self-improvement", "url": "https://techorama.be/agenda/session/leadership-and-the-power-of-regret-turning-emotions-into-action/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "14:30 - 15:30", "description": "\"No Regrets.\" You've probably seen the slogan on a social media post, or as a poorly-spelled tattoo. But though we might view the statement as a motto for a well-lived life, adopting it as a rule can lead to the worst sort of life of all - one where we can't learn from our failures, we can't examine the outputs of our teams, and neither we nor our organizations can grow into the things we were meant to be. \n\nLet's examine regret together, because regret can be a powerful force for leaders! It can help you identify the most effective changes you or your organization can make, and allows you to find continuous improvement in your software - and in yourselves. But you need to learn the fine line between experiencing regret and wallowing in it, how to use upward counterfactuals to learn and downward counterfactuals to feel better about the present, and how to turn the development horrors you've lived through into a story that the people you work with will listen to. You can figure out how to learn from regret that isn't your own, too. Come learn how to master regret, and you'll even be able to learn from mistakes you haven't made yet!"}, {"name_of_activity": "EF and NativeAOT: a deep dive into the heart of a query pipeline", "speaker_name": "Shay Rojansky", "room_number": "Room 10", "track_label": "Data Platform & BI", "url": "https://techorama.be/agenda/session/ef-and-nativeaot-a-deep-dive-into-the-heart-of-a-query-pipeline/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "14:30 - 15:30", "description": "Join us for a glimpse into the ongoing work to make EF Core 9.0 work with NativeAOT. We'll dive deep into EF's internals, where EF efficiently translates your LINQ queries to SQL, and explore the challenges and tricks in making such a complex component NativeAOT-compatible. On the menu are lots of expression trees, performance and a sprinkle of code generation for that special taste everyone loves."}, {"name_of_activity": "User adoption for Microsoft 365 copilot", "speaker_name": "Christian Decker", "room_number": "Room 11", "track_label": "Modern Workplace", "url": "https://techorama.be/agenda/session/user-adoption-for-microsoft-365-copilot/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "14:30 - 15:30", "description": "How can you actually use the strengths of Microsoft 365 Copilot in your company? Is it enough to give users the license and hope to make them more productive? In our session we will discuss the organizational implementation of Microsoft 365 Copilot, what steps you need to take to get the most benefit from the licenses for your users and how you can build a Copilot community to share knowledge and experiences within the company. We further discuss how you can ensure that the investment in the Copilot licenses is used in the best possible way by users"}, {"name_of_activity": "Spoilt for choice for real-time apps -  Azure Web PubSub or SignalR", "speaker_name": "Poornima Nayar", "room_number": "Room 13", "track_label": "Cloud Services", "url": "https://techorama.be/agenda/session/spoilt-for-choice-for-realtime-apps-azure-web-pubsub-or-signalr/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "14:30 - 15:30", "description": "Last year at NDC London I spoke about Azure Web PubSub and one of the most popular questions from the audience was how is it different to SignalR. So here I am with the answers.\n\nIn my session, we will look at both the services - Azure Web PubSub and Azure SignalR. We will understand the concepts to begin with - PubSub and SignalR. From there we will go into understanding the Azure Web PubSub service and Azure SignalR service and learn about the similarities and differences. By the end of my session, you will know how the services compare, the principles behind them and when to use them."}, {"name_of_activity": "Microsoft Teams Rooms best practices & notes from the field", "speaker_name": "Johan Delimon", "room_number": "Room 14", "track_label": "Modern Workplace", "url": "https://techorama.be/agenda/session/microsoft-teams-rooms-best-practices-notes-from-the-field/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "14:30 - 15:30", "description": "Learn how to enable any meeting space as a Teams Meeting space. Teams Meeting Rooms enable the hybrid workspace and bring modern, secure and inclusive meetings to everyone. Find out how you can easily deploy, configure and manage Microsoft Teams Room with best practices and notes from the field."}]}, {"time": "15:30 - 16:00", "activities": [{"name_of_activity": "Break", "speaker_name": null, "room_number": null, "track_label": null, "url": null, "day_of_week": "Tuesday", "date": "2024/05/07", "time": "15:30 - 16:00", "description": null}]}, {"time": "16:00 - 17:00", "activities": [{"name_of_activity": "Authentication in modern web apps with BFF - Backend for Frontend", "speaker_name": "Robert Folkesson", "room_number": "Room 1", "track_label": "Security", "url": "https://techorama.be/agenda/session/authentication-in-modern-web-apps-with-bff-backend-for-frontend/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "16:00 - 17:00", "description": "Are you still handling auth tokens in your web clients? Think again!\n\nBased on the experience from a current customer project - Robert Folkesson will talk about and demo why the handling of auth tokens in web clients is no longer the best solution, how the BFF - Backend for Frontend-pattern - can help secure SPA:s and Blazor Apps - and how implementing the pattern looks with Duende IdentityServer BFF Security Framework."}, {"name_of_activity": "Protecting Against Ransomware - Proven Concepts", "speaker_name": "Sami Laiho", "room_number": "Room 4", "track_label": "Security", "url": "https://techorama.be/agenda/session/protecting-against-ransomware-proven-concepts/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "16:00 - 17:00", "description": "On this session Sami Laiho will show you how to protect against the modern RansomWare campaigns. Sami has 25+ years of experience in protecting IT-environments and on this session he show the most effective solutions based on his real life experience."}, {"name_of_activity": "ASP.NET Core integration testing 101", "speaker_name": "Chris Klug", "room_number": "Room 5", "track_label": "Web & Frontend", "url": "https://techorama.be/agenda/session/aspnet-core-integration-testing-101/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "16:00 - 17:00", "description": "There is testing, and then there is testing. Some of it feels like a chore, and some of it just feels like it makes sense. \n\nWhen I started integration testing my ASP.NET API:s, it felt like one of those things that just made sense! I was able to quickly and easily call an API endpoint, and verify the result. Something that makes my life as a developer a lot easier. And on top of that, it not only gives me confidence that my API works as it should, it also makes sure that any changes I make are backwards compatible. Not to mention that the tests actually become pretty great documentation of how to use the API as well. Giving me all the things tests are supposed to give, but I never really felt like unit tests gave me. It's a win-win-win thing.\n\nHowever, there are some challenges that we need to address before we end up at this utopia. Things like being able to use a database during the tests. Handling security. Mocking 3rd party dependencies that can't be used during testing. But these are all things that we can overcome. \n\nIn this talk Chris will show you how to solve these things and set up an easy to use integration testing environment for your ASP.NET Core API:s."}, {"name_of_activity": "Navigating the Future: An Exploration of the Latest Features in Copilot Studio", "speaker_name": "Rick  Van Rousselt", "room_number": "Room 6", "track_label": "Power Platform", "url": "https://techorama.be/agenda/session/navigating-the-future-an-exploration-of-the-latest-features-in-copilot-studio/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "16:00 - 17:00", "description": "In this session we will focus on the advancements in Copilot Studio compared to Power Virtual Agents(PVA), offering a guide to the latest features and improvements. While the trusted capabilities of PVA remain the same in Copilot studio, like topics and entities, we can now leverage the power of Generative AI to create our bot faster, better, and with less effort. Let's explore how AI has revolutionized bot functionality, providing a smarter, more efficient way to interact with users. Whether you're just getting started with Copilot Studio or looking to upgrade your current Power Virtual Agent, this session will provide you with the insights needed to navigate the future of AI-integrated chatbots."}, {"name_of_activity": "Image Generation: Living on the Cutting Edge of AI", "speaker_name": "Jeff Prosise", "room_number": "Room 7", "track_label": "AI & IOT & ML", "url": "https://techorama.be/agenda/session/image-generation-living-on-the-cutting-edge-of-ai/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "16:00 - 17:00", "description": "Deep-learning models such as Stable Diffusion and DALL-E have stunned the world with their ability to generate images, remove objects from photos, reimagine images through a process called \"outpainting,\" and more. Learn how variational autoencoders, generative adversarial networks, and diffusion models work and how to use cutting-edge models trained on hundreds of millions of images to make your code come to life in ways that were never before possible."}, {"name_of_activity": "Tales from the Azure Migration Trenches", "speaker_name": "Jimmy Bogard", "room_number": "Room 8", "track_label": "Cloud Services", "url": "https://techorama.be/agenda/session/tales-from-the-azure-migration-trenches/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "16:00 - 17:00", "description": "Creating new systems and applications in the cloud can be a breeze. Most of us, however, live in the realities of an on-premise brownfield world. But now management wants to move to Azure, without losing data, and without disrupting users.\n\nIn this talk, I’ll share experiences of moving existing, live systems to Azure, with zero data loss and minimum to zero downtime. I’ll walk through analyzing existing applications and infrastructure, and how to decide whether to re-platform for PaaS or simply lift-and-shift.\n\nWe’ll also look at build and deployment scenarios to make sure we don’t have to stop all new development for our cloud migration. Finally, we’ll walk through a real-world, on-premise system and migrate it to Azure, live!"}, {"name_of_activity": "Automate your Infrastructure as Code", "speaker_name": "Gitte Vermeiren", "room_number": "Room 9", "track_label": "DevOps", "url": "https://techorama.be/agenda/session/automate-your-infrastructure-as-code/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "16:00 - 17:00", "description": "So you decided to start with Infrastructure as code. Might be you're doing ARM, might be that's still JSon based, might be that you're already on Bicep, or maybe you're that hipster utilizing Terraform (yes, I'm talking to you). Whatever language/framework you use, how do you now start collaborating on your IaC code and how can you start automatically deploying new changes. Do you put it all in one big repo or do you put responsibility with your developer teams? What are the tradeoffs between these two ways of working? \n\nIn this session I will walk you through the differences between ARM and TF and best practices on automation and collaboration for both. "}, {"name_of_activity": "How to Build UX Into Your Development Process", "speaker_name": "Dean Schuster", "room_number": "Room 10", "track_label": "Web & Frontend", "url": "https://techorama.be/agenda/session/how-to-build-ux-into-your-development-process/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "16:00 - 17:00", "description": "Everyone says they want a better user experience but development teams rarely know how to make this happen. How could they? Development processes, which dominate how we deliver digital products, usually downplay UX input or worse, exclude it entirely. The result is predictable. Most digital products are poorly designed, frustrating, and hard to use. \n\nIt’s high time to change that. If we want better user experiences, we need UX baked into our development process from the beginning. Come find out how to engage UX the right way and effectively incorporate it into your development process. You can take positive steps even if you’re in the middle of a project or your organization resists change. \n\nWhen we’re done, you’ll be ready to truly embrace the power of user experience. It will super-charge your work and make you the coolest developer in town."}, {"name_of_activity": "Murder Under the Big Top: An Azure AI Vision Mystery", "speaker_name": "Michelle Sandford - Developer Engagement Lead @Microsoft", "room_number": "Room 11", "track_label": "AI & IOT & ML", "url": "https://techorama.be/agenda/session/murder-under-the-big-top-an-azure-ai-vision-mystery/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "16:00 - 17:00", "description": "Step right up and welcome to the greatest show in the tech world! This isn’t just another conference talk, we’re diving into the thrilling world of Azure AI Vision Services to solve a mock murder mystery under the big top.\n\nIn this whimsical and captivating session, we’ll demonstrate how Azure’s object detection can spot the juggling pins(find the murder weapon), how people detection can identify the tightrope walker(find the suspects), how category identification can highlight the circus tents(pinpoint the location), and how OCR can decode the ringleader’s notes. While we won’t be sending in the clowns, attendees will get an entertaining and intriguing look at how these services work, and how they can be applied in their own projects.\n\nSo, grab your popcorn and join us under the big top as we unravel the mystery together with Azure AI Vision Services!"}, {"name_of_activity": "Pragmatic Typings - Patterns to Reduce Friction and Spark Joy", "speaker_name": "Jan-Niklas Wortmann", "room_number": "Room 13", "track_label": "Web & Frontend", "url": "https://techorama.be/agenda/session/pragmatic-typings-patterns-to-reduce-friction-and-spark-joy/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "16:00 - 17:00", "description": "Do you struggle with TypeScript typings or feel like you hit a learning plateau? Are you constantly fighting your compiler and red squiggly lines in your editor?\nI am 99.99% sure the problem you are having is not with TypeScript but the way you are using it. Let me show you patterns you can use to minimize the time you feel like you are fighting TypeScript and allow you to still enjoy all its benefits. I'll use these patterns to help you learn to love TypeScript and feel confident using things like Type Guards, Generics and Type Inference, and help you keep your code base \"as any\" and \"@ts-ignore\" free."}, {"name_of_activity": "Practical guidelines to improve your code readability", "speaker_name": "Ben Luts", "room_number": "Room 14", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/practical-guidelines-to-improve-your-code-readability/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "16:00 - 17:00", "description": "Software development is easy, if not for two things. Cache invalidation & how to name stuff, and keeping your code readable by extension. Let's talk about the latter. In this talk I try to sketch where we mostly go wrong and how we can fix or, even better, avoid making the same mistakes. How we can use refactoring to improve readability, tips on code structuring and practical ideas on proper naming. Beware though, I might burst some bubbles along the way."}]}, {"time": "17:00 - 17:15", "activities": [{"name_of_activity": "Break", "speaker_name": null, "room_number": null, "track_label": null, "url": null, "day_of_week": "Tuesday", "date": "2024/05/07", "time": "17:00 - 17:15", "description": null}]}, {"time": "17:15 - 18:15", "activities": [{"name_of_activity": "Five Do's and Don'ts for your Entra ID!", "speaker_name": "Sander Berkouwer, Raymond Comvalius", "room_number": "Room 1", "track_label": "Security", "url": "https://techorama.be/agenda/session/five-dos-and-donts-for-your-entra-id/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "17:15 - 18:15", "description": "With Microsoft's focus on Defender for * and Entra Premium P2 features, you might start to believe that you can't be successful in your identity and zero trust journeys when you don't have these products and licenses. The opposite is true: without doing the basics in your Azure AD tenant, all these advanced products don't perform as well as you'd think...\n\nAfter numerous Entra ID security assessments, Sander Berkouwer has identified the basics that most organizations seem to have forgotten. Without these basic measures, their Microsoft 365 services are at risk in terms of security, privacy, and productivity. For most organizations applying these basics is trivial and relatively easy to start with. \n\nCome to this session to learn the five Do's and five Don'ts for your Entra ID tenant!"}, {"name_of_activity": "How Software Developers Destroy Business Value (and What to Do About It)", "speaker_name": "Aaron Stannard", "room_number": "Room 4", "track_label": "Motivational & self-improvement", "url": "https://techorama.be/agenda/session/how-software-developers-destroy-business-value-and-what-to-do-about-it/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "17:15 - 18:15", "description": "Software developers are intended to be massive, highly leverageable value creators for their companies and teams - using their creative and technical talent to build products themselves or mission-critical systems that facilitate the delivery of value inside the business.\n\nThe blunt truth, however, is that many software developers would screw up tying their own shoes when left to their own devices.\n\nThere's an abundant corpus of work out there on how managers routinely let down their software developers through insufficient planning, communication, listening, and support. \n\nIn this talk we're going to explore the inverse - how individual software developers contributing to a project unintentionally sabotage their teams, their companies, their projects, and themselves through:\n\n* Immutable technical preferences + biases;\n* Bad attitudes;\n* Poor listening;\n* Inflexible and unproductive learning styles; \n* Risk aversion;\n* Incuriosity;\n* And more!\n\nMost importantly, in this talk we're going to try to address how we can help shift developers who want to learn and improve, but are have trouble executing, become the high value contributors they'd like to be."}, {"name_of_activity": "Turbocharge Coldstarts With ASP.NET Core Native AOT", "speaker_name": "Rainer Stropek", "room_number": "Room 5", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/turbocharge-coldstarts-with-aspnet-core-native-aot/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "17:15 - 18:15", "description": "Coldstart times matter, especially in the cloud. If you want to take advantage of elastically scaling infrastructures, your web APIs and apps must not take forever to get started. In that regard, Native AOT is a game-changer for .NET. In this session, renowned Azure MVP Rainer Stropek demonstrates how to prepare your code for Native AOT. He describes how the new Interceptors feature in C# enables the new .NET compile target. Last but not least, Rainer will provide an overview of what ASP.NET Core features are already usable with Native AOT."}, {"name_of_activity": "High Performance JSON Serialization with Code Generation on C# 12 and .NET 8.0", "speaker_name": "Ian Griffiths", "room_number": "Room 6", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/high-performance-json-serialization-with-code-generation-on-c-12-and-net-80/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "17:15 - 18:15", "description": "In this talk you will see how features added to recent versions of C# can dramatically improve parsing and generation of JSON data compared with longer established .NET JSON handling mechanisms. You will see how to use high-performance memory-efficient techniques (including Spans and IO Pipelines), and also how code generators can reduce runtime overheads. This talk will explore the tradeoff between maximizing performance and ease of use, and will show how choose between the various options now available in modern .NET applications."}, {"name_of_activity": "Networking Fundamentals for the Cloud", "speaker_name": "Derek Martin", "room_number": "Room 7", "track_label": "Cloud Services", "url": "https://techorama.be/agenda/session/networking-fundamentals-for-the-cloud/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "17:15 - 18:15", "description": "Contrary to popular belief, almost no customer is “all in” in the cloud. Almost all customers are hybrid, therefore, networking is an essential capability to understand deeply for cloud success. Additionally, many customers still leverage networking as the defacto security apparatus of their organization. While it is an important component there are many newer, more modern capabilities and we come to the cloud as we are, not as we wish to be. The Azure Networking Primitives have been designed to enable every organization on the planet, regardless of their historical security, management or governance capabilities to be successful. The Azure networking primitives will dazzle networking engineers of all types and far outpace our competitors. Join us in this session to talk about the Azure Networking primitives, how they can be molded to fit your hybrid approach to cloud and not box yourself out of future, more modern approaches to governance and security options."}, {"name_of_activity": "C# Language Internals - 25th Anniversary", "speaker_name": "Bart De Smet", "room_number": "Room 8", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/c-language-internals-25th-anniversary/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "17:15 - 18:15", "description": "C# is turning 25 year! Time to revamp one of Bart's long time classic talks with new content for the latest C# releases up to the latest 12.0 release.\n\nIn this 100% live demo talk, you get to pick which language features will end up on Bart's dissection table!\n\nFasten your seatbelts and join me to (de)compile C# code, dive into IL, and browse or step though the Roslyn compiler."}, {"name_of_activity": "Database Deployment Automation using Database Projects & Azure DevOps", "speaker_name": "Olivier Van Steenlandt", "room_number": "Room 9", "track_label": "Data Platform & BI", "url": "https://techorama.be/agenda/session/database-deployment-automation-using-database-projects-azure-devops/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "17:15 - 18:15", "description": "You have implemented Database Projects and Azure DevOps for database development successfully in your organization and you want to make your life easier by automating your database deployments? If the answer is yes, this session is for you!\n\nAt the beginning of this session, we will do a quick recap of Database Projects and Azure DevOps. Just to make sure that we are all on the same page.\n\nDuring the session, we will set up an example build and deploy pipeline. Since there are a couple of ways to deploy changes from Azure DevOps to your target database, We will discuss a couple of scenarios and I will show you which method I'm using.\n\n- 1 Pipeline to rule them all\n- multi-step deployment\n\nDuring this session, we will also cover the deployment pipeline differences between SQL Server and AzureSQL.\n\nAt the end of this session, you should have all you need to start with database deployment automation.\n\n"}, {"name_of_activity": "What I have learned from implementing a landing zone using Bicep", "speaker_name": "Steven De Lausnay", "room_number": "Room 10", "track_label": "DevOps", "url": "https://techorama.be/agenda/session/what-i-have-learned-from-implementing-a-landing-zone-using-bicep/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "17:15 - 18:15", "description": "When creating a landing zone for Azure, there are several possibilities to implement all of the automation. One of the ways is to use Bicep as your main source to automate the deployment of your Azure resources. But not everything from a landing zone can be automated with Bicep so some parts will need to be configured using e.g., Azure CLI commands. Examples are the creation of user groups, apply RBAC roles, setup DevOps projects, etc.\n\nWe have created a complete flow for automating a landing zone where we have used Bicep and Az CLI to perform a complete automation. In this session I will share some of the insights about how we have setup some parts of the automation, where we used bicep and what we performed with commands. For the Bicep part, we have applied the CARML principle to build parts of the landing zone to improve the maintainability of the complete landing zone. Next to the flow, I will also give insights on some issues we have encountered, some things you need to be aware of when using this setup, etc. Examples are on the networking resources, finding out if resources are already deployed, add settings without removing existing settings, etc."}, {"name_of_activity": "Securing Azure Cosmos DB", "speaker_name": "Leonard Lobel", "room_number": "Room 11", "track_label": "Cloud Services", "url": "https://techorama.be/agenda/session/securing-azure-cosmos-db/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "17:15 - 18:15", "description": "Every database needs to be secured, and Azure Cosmos DB provides enterprise-class security features to make certain that all your data is fully protected. In this session, you’ll learn how to setup network security – the first line of defense against any unauthorized access. We’ll cover the IP firewall and VNet access using service endpoints, plus how to enable private endpoints for a solution that’s completely isolated from the public internet. We’ll then move on to authentication options using master keys, resource tokens, and Microsoft Entra ID integration. Finally, we’ll look at built-in server-side encryption using Microsoft managed keys and customer managed keys, plus client-side encryption which ensures that highly sensitive data is always encrypted, and accessible only through applications that you approve. Attend this session and arm yourself with the skills you need to secure your database in Azure Cosmos DB!"}, {"name_of_activity": "Automated Testing for Microsoft 365 with Playwright", "speaker_name": "Elio Struyf", "room_number": "Room 13", "track_label": "Modern Workplace", "url": "https://techorama.be/agenda/session/automated-testing-for-microsoft-365-with-playwright/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "17:15 - 18:15", "description": "In this session, we will explore how to use Playwright to automate testing of Microsoft 365 applications. We will focus on how Playwright can be used to create end-to-end tests that verify the behavior of Microsoft 365 applications for Microsoft Teams, and SharePoint. We will discuss how Playwright can be integrated into a continuous integration and deployment (CI/CD) pipeline, and how it can be used to catch bugs and regressions before they reach production. Additionally, we will provide tips and best practices for creating effective tests that cover common scenarios in Microsoft 365 applications. By the end of this session, attendees will have a deeper understanding of how to use Playwright to improve the quality of their Microsoft 365 applications."}, {"name_of_activity": "A Developer Goes to the Movies", "speaker_name": "Simon Painter", "room_number": "Room 14", "track_label": "Motivational & self-improvement", "url": "https://techorama.be/agenda/session/a-developer-goes-to-the-movies/", "day_of_week": "Tuesday", "date": "2024/05/07", "time": "17:15 - 18:15", "description": "As well as being a full-time software developer, I'm also a huge film buff. I love films from any number of countries, eras and genres. One of my favourite things though, is when Hollywood decide to make a film touching on my day job - that is, a film that's about software development.\n\nThere aren't very many of these, rather unsurprisingly, considering how dry the topic can be for the \"not-we\" that make up the majority of a cinema audience.\n\nWhat I'm going to do in this talk is take you on a whistle-stop tour of film history, looking at many of the films that try to show the rest of the world what our jobs are like.\n\nI'll be looking at firstly - are they actually good films? But also, how accurate are they? What sorts of social trends informed a portrayal like this?\n\nOn this brief odyssey through cinema history we'll cover:\n\n* The first film to depict a developer. You won't believe when it's from and who the actor is!\n* How have developers been portrayed differently over the years? Particularly with regard the role of women in tech\n* How The Matrix wasn't the first VR world by near 30 years!\n* A 90s cyber-thriller that clearly doesn't understand the difference between websites and executables\n* How AI is very definitely going to kill us all. At least according to any number of old SF action-thrillers\n* An old episode of Doctor Who from the 60s that predicted the internet (ok, not Hollywood, but I love Doctor Who!)\n\nThis talk won't help you do your job better, but it might give you a glimpse into how the rest of the world have seen us over the years!\n\n"}]}, {"time": "07:30 - 08:30", "activities": [{"name_of_activity": "Registration & breakfast", "speaker_name": null, "room_number": null, "track_label": null, "url": null, "day_of_week": "Wednesday", "date": "2024/05/08", "time": "07:30 - 08:30", "description": null}]}, {"time": "07:30 - 08:20", "activities": [{"name_of_activity": "Desktop Apps Your Way!", "speaker_name": "Sam Basu", "room_number": "Room 5", "track_label": "Architecture", "url": "https://techorama.be/agenda/session/desktop-apps-your-way/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "07:30 - 08:20", "description": "Most modern developers love to work with bleeding-edge technologies. Unsurprisingly, .NET developers are invested in Blazor or .NET MAUI. JavaScript developers swear by their beloved SPA frameworks for web apps. But customers or enterprise business workflows often demand Windows/macOS/Linux Desktop apps. What gives?\n\nTurns out, there are a lot of ways to reach desktop audiences and modern development stacks can enable better code sharing. ROI is important & modernization can be done in steps. \n\nWPF & WinForms run on latest .NET and support islands of modernness. WinUI is the latest native Windows UI/UX framework for both Win32 & UWP apps. AppKit with Swift UI or Mac Catalyst enable native macOS desktop apps. .NET MAUI formalizes desktop support with native Windows/macOS apps through WinUI or Mac Catalyst. Uno Platform or Avalonia are happy to take XAML lovers to just about any platform, while Flutter does the same with Dart.\n\nTurns out, web technologies are welcome on desktop as well. PWA or Electron is all grown up with mature tooling. & platform integration. Blazor isn’t just for modern server/client web apps, but now powers native desktop apps with PWA or Electron, but the most optimized match is with .NET MAUI. Web components and styles can be easily shared between web & native apps. JavaScript is also welcome on desktop – Interops help.\n\nDesktop is here to stay, and modern technologies provide lots of ways of bridging the gap. Come see the possibilities!"}, {"name_of_activity": "What's new in .NET 8 & C# 12", "speaker_name": "Filip Ekberg", "room_number": "Room 8", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/whats-new-in-net-8-c-12/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "07:30 - 08:20", "description": "Let's focus on the important news in C# and .NET. \n\nPerformance, beautiful code with new language features, cross-platform, and lots more; it's all getting better with the latest release of .NET!"}]}, {"time": "08:30 - 09:30", "activities": [{"name_of_activity": "PostgreSQL Superpowers in Practice", "speaker_name": "Oskar Dudycz", "room_number": "Room 1", "track_label": "Data Platform & BI", "url": "https://techorama.be/agenda/session/postgresql-superpowers-in-practice/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "08:30 - 09:30", "description": "Intriguingly, PostgreSQL is both popular and underrated. Many people use it because it's for free, not knowing its superpowers. Postgres has become a model example of how to create relational databases. In many elements, a model engine. We will look at its unusual features, such as partitioning, push notifications, rich extensions ecosystem etc. We will avoid boring scenarios, play with the code and see what it can be useful for in practice. We'll end up with a simple but real fleet management reporting and alerting scenario."}, {"name_of_activity": "Entra ID App registrations – The good, bad and the ugly", "speaker_name": "John Craddock", "room_number": "Room 4", "track_label": "Security", "url": "https://techorama.be/agenda/session/entra-id-app-registrations-the-good-bad-and-the-ugly/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "08:30 - 09:30", "description": "Registering an app in Entra ID looks really easy at first glance, but as you dig deeper, there are many choices you have to make for your application to work correctly and remain secure. John Craddock has worked with app registration since they were first introduced in the Azure portal. \n\nCome to this demo lead session and learn how to manage app registrations correctly and the relationship between app registrations and enterprise applications. This deep dive session will help you accurately register and secure your Entra ID applications.\n\nAs a precursor to this session it's recommended you attend John's session on Day 1 at 2:30: OpenID Connect and OAuth 2.0 Primer\n"}, {"name_of_activity": "C# Productivity in VS Code", "speaker_name": "Leslie Richardson", "room_number": "Room 5", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/c-productivity-in-vs-code/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "08:30 - 09:30", "description": "It’s never been easier to be productive writing C# applications in Visual Studio Code! In this demo-heavy session, come learn about tips and tricks for getting the most out of VS Code with the latest VS Code updates and the new C# Dev Kit extension. We’ll explore how you can navigate your codebase with ease, leverage IntelliSense for faster coding, and utilize debugging tools effectively."}, {"name_of_activity": "Forward to the Past and Back to the Future - Cybercrime in 2022/2023", "speaker_name": "Sami Laiho", "room_number": "Room 6", "track_label": "Security", "url": "https://techorama.be/agenda/session/forward-to-the-past-and-back-to-the-future-cybercrime-in-20222023/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "08:30 - 09:30", "description": "Join Sami Laiho, Chief Research Officer of Truesec, for a look back in to what 2023 changed in the Security Threat Landscape and to hear his predictions on what the future will have in store for us."}, {"name_of_activity": "Indispensable Principles for Designing Complex User Interfaces", "speaker_name": "Dean Schuster", "room_number": "Room 7", "track_label": "Web & Frontend", "url": "https://techorama.be/agenda/session/indispensable-principles-for-designing-complex-user-interfaces/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "08:30 - 09:30", "description": "Complex, data-intensive web applications pose significant, difficult challenges. Mission-critical apps often require compact, narrow, crowded interfaces that only a master Excel ninja could love (or use). Welcome to endless data, filters, sorting, tabs, drop-downs, modals, buttons, and voluminous grids. How do we balance vital functionality with real-world usability?\n\nYou CAN make stellar, efficient, easy-to-use mobile and web apps even when faced with these stark challenges. \n\nIn this session, you’ll learn the tips, tricks, and secrets to help you masterfully define and build complex yet easy-to-use digital products for expert users.\n\nThese principles will change the way you think about constrained interface design. And your users will love you for it."}, {"name_of_activity": "Make AI Come to Life with OpenAI", "speaker_name": "Jeff Prosise", "room_number": "Room 8", "track_label": "AI & IOT & ML", "url": "https://techorama.be/agenda/session/make-ai-come-to-life-with-openai/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "08:30 - 09:30", "description": "OpenAI offers ChatGPT, GPT-4, and other Large Language Models (LLMs) that you can use to infuse generative AI into your apps and business processes. It also publishes APIs that use these models to retrieve data from documents and databases, turn data into charts and graphs, create virtual assistants with domain expertise, and more. Learn how companies are using OpenAI models and APIs to transform their business, and come away with numerous code samples for kick-starting transformations of your own."}, {"name_of_activity": "Azure Architecture: Choosing wisely", "speaker_name": "Rik Hepworth", "room_number": "Room 9", "track_label": "Cloud Services", "url": "https://techorama.be/agenda/session/azure-architecture-choosing-wisely/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "08:30 - 09:30", "description": "The menu of Azure services is rich and vast. Selecting the best match for your application’s needs can be a daunting choice.\nIn this session we will create an architecture for a cloud-native application, with requirements that are taken from several real-world projects to provide a realistic scenario that should resonate with your own experiences.\nWe will look at the requirements and discuss which Azure services could be used to deliver them, discussing the options and explaining the final choice.\nAs our architecture diagram steadily expands we will discuss the impact of specific security requirements and how the architecture may need to change to satisfy them. We will also discuss monitoring and telemetry and how they affect our design.\nBuilding an application in the cloud is a team sport. This session should provide learning for all involved: Developers writing applications who are involved in technology choices, IT Pros and Ops teams that manage and operate Azure within their organisation, Architects that design cloud applications and need to go through this process themselves, and finally managers who want to understand more about what their teams need to do in order to build cloud-native applications."}, {"name_of_activity": "Finding your service boundaries - a practical guide", "speaker_name": "Adam Ralph", "room_number": "Room 10", "track_label": "Architecture", "url": "https://techorama.be/agenda/session/finding-your-service-boundaries-a-practical-guide/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "08:30 - 09:30", "description": "We know it's useful to split up complex systems. We've seen the benefits of modular deployment of microservices. Dealing with only one piece of code at a time eases our cognitive load. But how do we know where to draw the service boundaries? In complex business domains, it's often difficult to know where to start. When we get our boundaries wrong, the clocks starts ticking. Before long, we hear ourselves say \"it would be easier to re-write it\".\n\nJoin Adam for practical advice on discovering the hidden boundaries in your systems. Help tease out the natural separation of concerns in a sample business domain. During 20 years of developing complex systems, Adam has had plenty of time to get things wrong. Learn to avoid the common pitfalls that can lead us down the path to \"the big re-write\"."}, {"name_of_activity": "Level Up with GitHub Copilot - A Journey to Customization", "speaker_name": "April Yoho", "room_number": "Room 11", "track_label": "DevOps", "url": "https://techorama.be/agenda/session/level-up-with-github-copilot-a-journey-to-customization/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "08:30 - 09:30", "description": "The release of GitHub Copilot defined a new paradigm in AI-powered developer tools. Since its inception, GitHub Copilot provided developers with the ability to increase their productivity. However, there were limitations around personalization present. Join this session to learn about how GitHub Copilot can provide a customized solution. We will introduce the new initiatives around customization, the challenges, opportunities, and what a customized GitHub Copilot can do to address your enterprise use cases. \n\nWe will show you how to automate your pull requests with Copilot, search and index your own repositories and of course the LATEST Copilot features in your IDE. "}, {"name_of_activity": "Wasm Deep Dive - A Glance Behind the Scenes", "speaker_name": "Rainer Stropek", "room_number": "Room 13", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/wasm-deep-dive-a-glance-behind-the-scenes/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "08:30 - 09:30", "description": "WebAssembly has become an important technology in web development, on the server and client side. In this session, we want to take a look behind the scenes and dive deeper into fundamentals like WebAssembly's stack-based programming model, memory management, and interaction with Wasm hosts. Based on samples in WAT (WebAssembly Text), Rust, and C, Rainer Stropek speaks about core principles of Wasm and WASI. Rainer will show examples in the browser and in WebAssembly hosts like Wasmtime and Wasmer."}, {"name_of_activity": "Zero Trust Network Access with Microsoft Entra Private Access", "speaker_name": "Torbjörn (Mr T-Bone) Granheden", "room_number": "Room 14", "track_label": "Modern Workplace", "url": "https://techorama.be/agenda/session/zero-trust-network-access-with-microsoft-entra-private-access/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "08:30 - 09:30", "description": "Are you still using VPN to access your local network resources? VPN is old technology and gives a false sense of security. Always on and full access to all LAN resources. Time to think Zero Trust and implement a modern solution for intranet access. \nMicrosoft Entra Global Secure access with the components Microsoft Entra Private Access and Microsoft Entra Internet Access builds on the Zero Trust principles:\nVerify explicitly: By using Modern Authentication and Conditional Access\nLeast Privilege: By only allowing access to specific resources\nAssume breach: By monitoring and managing connections\nIn this session we explain the concept and show the power of the technology."}]}, {"time": "09:30 - 09:45", "activities": [{"name_of_activity": "Break", "speaker_name": null, "room_number": null, "track_label": null, "url": null, "day_of_week": "Wednesday", "date": "2024/05/08", "time": "09:30 - 09:45", "description": null}]}, {"time": "09:45 - 10:45", "activities": [{"name_of_activity": "Cloud Development with Azure Developer CLI (azd)", "speaker_name": "Jonah Andersson", "room_number": "Room 1", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/cloud-development-with-azure-developer-cli-azd/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "09:45 - 10:45", "description": "As an open-source developer tool, Azure Developer CLI (azd) is a great cloud development tool for developers working with Azure. \nazd allows you to develop with Azure with consistently across the terminal, integrate with your DevOps CI/CD pipelines like GitHub Actions and more. \n\nIn this session, Jonah Andersson will share the important concepts you need to get started with Azure Developer CLI (azd) for your development projects - from configuring your local environment or dev containers, using azd templates, and other great stuff you need to know."}, {"name_of_activity": "Goodbye Azure Kubernetes Service! Hello Azure Container Apps!", "speaker_name": "Johnny Hooyberghs", "room_number": "Room 4", "track_label": "Cloud Services", "url": "https://techorama.be/agenda/session/goodbye-azure-kubernetes-service-hello-azure-container-apps/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "09:45 - 10:45", "description": "You have decided to run your cloud-native applications using containers? But how will you deploy these containers to Azure Cloud?\nAKS or Azure Kubernetes Service is very popular, but also adds a lot of complexity to setting-up and deploying your infrastructure!\nACI or Azure Container Instances are very easy to setup, but don't offer you enough flexibility?\nACA or Azure Container Apps are Microsoft Azure's new serverless container offering, built as an abstraction on top of AKS, and could be the solution to your question!\nIn this session I will introduce you to Azure Container Apps and compare it to AKS and ACI and guide you through setting-up a multi-container app using Azure Container App container environments."}, {"name_of_activity": "Azure OpenAI for the ASP.NET Core developer", "speaker_name": "Marco De Sanctis", "room_number": "Room 5", "track_label": "AI & IOT & ML", "url": "https://techorama.be/agenda/session/azure-openai-for-the-aspnet-core-developer/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "09:45 - 10:45", "description": "Very few advancements in technology have been so disruptive like Open AI's Chat GPT: thanks to its capability of handling unstructured data, and the ease of customization of its behaviour, we can now bring our applications to a level never seen before.\n\nThis talk presents a look at Azure OpenAI from the point of view of an application developer and show how we can leverage all its horsepower in our ASP.NET Core and Blazor solution to provide functionalities which were simply unthinkable just a few months ago.\n\nDuring this talk we'll demonstrate some practical examples of how to do that: as a first step, we'll familiarise with the GPT's deployment model and completion API, and then shift our usage model from a simple chat to something closer to a programmable AI model. We'll show how, simply engineering the requests, we can bend its behaviour to accomplish a whole sort of different tasks, and how using functions will allow us to integrate it with the rest of services our application exposes.\n\nAs a last step, we'll then be tackling integration with our data. On one end, we'll learn how to use embeddings and vector search over our datasets, and what are the benefits of it. Then, we'll combine GPT models with Azure Synapse to perform data analysis over big data files."}, {"name_of_activity": "Quantum computing - the next best thing?", "speaker_name": "Hanna Engel", "room_number": "Room 6", "track_label": "AI & IOT & ML", "url": "https://techorama.be/agenda/session/quantum-computing-the-next-best-thing/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "09:45 - 10:45", "description": "The one who rules the quantum computer rules the world.\nForget the AI, zoom in and explore the meanders of the quantum world.\nI hope you have all read by now that top tech companies are working on a Quantum Computer . And it is going well.\n*Why should you care?*\nIF or rather WHEN we break the quantum barrier and make the computers error-prone, it will impact the world as we know now.\nWhy?\nSecurity.\nWhenever you talk to a security specialist they will tell you that no IT security solution can guarantee 100% protection. It can \"decrease the surface of the attack\" or \"decrease the ROI of the attacker\" - what does it mean? Simply put, there's an assumption that if it would take a hacker 34 years to break encrypted data - the data is protected. After all \"ain't nobody got time for that\", right?\nWhich does not mean the encryption is unbreakable. An encrypted string is nothing more that a long string of random letters, numbers and signs. The computer that would want to break such a string would have to work through all possible combinations of all the possible signs. Which you can imagine takes time and effort.\nFor an \"average\" computer.\nBut not a quantum one.\nCalculations that would take a regular computer 34 years can take quantum computer hours or minutes.\n\nAgenda:\nQuantum Physics - intro\nQuantum - not just a faster computer!\nAdios, encryption!\nWhen can I buy my own Quantum Computer?"}, {"name_of_activity": ".NET Microservices with Dapr - too much abstraction or the way to go?", "speaker_name": "Marc Müller", "room_number": "Room 7", "track_label": "Architecture", "url": "https://techorama.be/agenda/session/net-microservices-with-dapr-too-much-abstraction-or-the-way-to-go/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "09:45 - 10:45", "description": "Microservice architectures are in vogue today, but in reality they are often more difficult to implement than they seem. Dapr promises to remedy this and to support the developer with various building blocks and to enable a simple and efficient implementation of microservice architectures.\n\nThe session explains how dapr works and demonstrates its use with an example application. We take a critical look at the advantages and disadvantages that dapr brings."}, {"name_of_activity": "Cursed C#", "speaker_name": "Nick Chapsas", "room_number": "Room 8", "track_label": "Web & Frontend", "url": "https://techorama.be/agenda/session/cursed-c/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "09:45 - 10:45", "description": "You may think you know how to write C#, but below the surface, the vars and the interfaces lie an iceberg of opportunities where C# features can be used in ways most developers have never even considered. For the past few years, I've been so preoccupied with whether or not some of the things I'll show you in this session could happen that I didn't stop to think if they should. I call them \"Cursed C#\".\n\nNow, will you learn something you should apply to your day-to-day job? Probably not. Will you question your knowledge of the language you've been using for years? Absolutely. Will you return to your job on Monday trying to apply some of the practices you'll see in this session, even though I was very clear that you shouldn't do that? There is no question about it. Join me anyway, it will be fun."}, {"name_of_activity": "Mirror, mirror on the wall... Am I a critical thinker after all?", "speaker_name": "Laila Bougria", "room_number": "Room 9", "track_label": "Motivational & self-improvement", "url": "https://techorama.be/agenda/session/mirror-mirror-on-the-wall-am-i-a-critical-thinker-after-all/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "09:45 - 10:45", "description": "How many times have you looked back at a project only to find a mix of technologies, architectural styles, patterns, and practices that somehow just don’t fit together, only to conclude: This is unmaintainable... Let's rewrite the whole thing! As tech professionals, we usually pride ourselves in our ability to think critically because, as part of our work, we continuously tackle complex problems. But are we really critical thinkers? If so, which decisions led to this point? Were they made consciously? What decision framework was used to structure our thoughts and avoid biases?\n\nOver the last years of my career, I have applied practices to decision-making that have significantly improved my decision-making and how I evaluate and challenge decisions made by others. In this session, I'll share the essential building blocks that improve critical thinking, help break through biases, and improve our intent and communication when making impactful decisions. You'll learn to apply tactics to help identify assumptions, evaluate options objectively, and assess risk. You'll walk out of this session with actionable takeaways that will help strengthen your decisions in our complex and ever-changing technology landscape."}, {"name_of_activity": "Introduction to Actor-based Development with Project Orleans", "speaker_name": "Chris Klug", "room_number": "Room 10", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/introduction-to-actorbased-development-with-project-orleans/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "09:45 - 10:45", "description": "There are some domains that are really hard to model using your standard n-tier architecture. Domains like real time vehicle tracking, auctions and many IoT scenarios. Sure, they might look easy enough, and “work on my machine”, but when you start throwing some load at it, it can start to crumble quite quickly. And going down the good ol’ “Eventual Consistency Road” isn’t always an option, as consistency is actually important in some cases.\n\nHowever, these aren’t new problems, and smart people have already created solutions for them. Solutions like the Actor pattern, which solves the problem by using in-memory “actors” to make life simpler. Unfortunately, the Actor pattern introduces another set of challenges. Things like instance proxying, state management, clustering, actor distribution and so on. Topics that most of us don’t feel like solving on our own. Luckily, Microsoft has already built all of this for us, in something they call Project Orleans.\n\nWhy not join Chris Klug, as he explains how Project Orleans can help you to solve scenarios like the ones described above. It might be worth noting though, that if you like slide heavy presentations with lots of theory and little practice, you should probably stay away. This session uses lots of demos to show you the practicalities of getting started building solutions using Project Orleans, and the features is offers. So please come well rested, and ready for a lot of coding.\n"}, {"name_of_activity": "Using Lakehouse Data at scale with Power BI, featuring Direct Lake mode", "speaker_name": "Benni De Jagere", "room_number": "Room 11", "track_label": "Data Platform & BI", "url": "https://techorama.be/agenda/session/using-lakehouse-data-at-scale-with-power-bi-featuring-direct-lake-mode/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "09:45 - 10:45", "description": "Many companies have invested heavily in building data lakes to store large volumes of structured and unstructured data from various sources into Delta Parquet files. These Delta Parquet files can be used for a wide range of Analytics and Business Intelligence applications. Most of these organizations struggle to derive insights from their investments due to the complexity of accessing and querying the data, and how to let self-service users connect to this data in the lake using Power BI.\n\nWith the introduction of Microsoft Fabric, an all-in-one analytics solution for enterprises, we now have a better approach for this. In this session, we will explore how to use Lakehouse data at scale with Power BI, using the new Direct Lake connectivity mode. Power BI Direct Lake combines the best of both worlds from Import and DirectQuery mode, and gives us the option for great performance over data in the lake, without introducing additional latency for dataset refreshes.\n\nWe will start by discussing the benefits of the Lakehouse architecture and how it can improve data management and analytics. We will then move on to explore how to connect to Lakehouse data using Power BI by combining both of these architecture components and using each of them to their strengths.\n\nWe will also cover best practices for optimizing performance when working with large volumes of data, including using data partitioning and query optimization techniques. We will demonstrate how to use Power BI to analyze Lakehouse data in real-time and how to build reports that provide actionable insights for decision-making.\n\nBy the end of the session, attendees will have a solid understanding of how to leverage Lakehouse data at scale with Power BI and how to build powerful analytics solutions that can handle massive amounts of data. Whether you are a data analyst, data scientist, or BI professional, this session will provide you with valuable insights into the world of Lakehouse data and Power BI, featuring the new Direct Lake connectivity mode.\n"}, {"name_of_activity": "Extend Your Workspace and Improve Your Output with Nx Plugins", "speaker_name": "Lara Newsom", "room_number": "Room 13", "track_label": "DevOps", "url": "https://techorama.be/agenda/session/extend-your-workspace-and-improve-your-output-with-nx-plugins/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "09:45 - 10:45", "description": "There’s a reason pipeline and configuration tickets are often the last ones picked up in a sprint. Configuration can vary wildly from one application to the next and documenting all of the steps required for developers to add new libraries of functionality to an application is difficult to maintain. Even writing a new feature often involves a deep understanding of the underlying architecture of the application. So what can we do to make it easier for our devs to write and release code? Nx offers a large collection of plugin packages to help easily extend your workspace and add steps to your pipeline, but did you know you can also create your own custom plugins that extend the Nx supported plugins to generate and execute code specific to your application? In this talk we will introduce some of the Nx supported plugins and then quickly get into writing our own fully testable plugin to generate code and execute steps in our pipeline. "}, {"name_of_activity": "Implementing the planet's largest e-commerce site using service boundaries", "speaker_name": "Dennis van der Stelt", "room_number": "Room 14", "track_label": "Architecture", "url": "https://techorama.be/agenda/session/implementing-the-planets-largest-ecommerce-site-using-service-boundaries/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "09:45 - 10:45", "description": "How often did you see a session about any kind of services and heard about how important it was to find the right boundaries, but until now you wondered how to find the right boundaries. Or what those boundaries look like once implemented, how services behave and what data they own. And how on earth business data cannot cross those service boundaries, but invoices are required to have product, customer and pricing details.\n\nIn this session we'll see an example of how the planet's largest electronic retailer would find the service boundaries for its checkout process. Then we'll look at how each service is part of choreographing this complex business process in an actual implementation. You'll finally understand the full flow from finding service boundaries to implementation and be able to break down a big ball of mud into a maintainable and decoupled system."}]}, {"time": "10:45 - 11:15", "activities": [{"name_of_activity": "Break", "speaker_name": null, "room_number": null, "track_label": null, "url": null, "day_of_week": "Wednesday", "date": "2024/05/08", "time": "10:45 - 11:15", "description": null}]}, {"time": "10:50 - 11:10", "activities": [{"name_of_activity": "Running Smart City data platforms on Azure", "speaker_name": "Gert De Tant", "room_number": "Room 8", "track_label": "Data Platform & BI", "url": "https://techorama.be/agenda/session/running-smart-city-data-platforms-on-azure/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "10:50 - 11:10", "description": "Most cities today are, or aspire to be, smart cities. Although the exact definition of a smart city can vary, data is always a key element. At Sirus, we specialize in data and smart cities among other things. We architect, build and operate Smart City platforms and Digital Twins. A crucial aspect of both is the ability to connect data from different domains: to make smart analyses, make predictions, and make informed decisions. It is essential that everything is interconnected: traffic influences the environment, both interact with city planning, all of which in turn impacts well-being and so on. Everything is therefore interconnected, especially when you want to tackle the so-called “wicked problems”. Azure is an ideal platform to build and run these types of solutions. With standard building blocks from Azure and open source components, we build interoperable, flexible and scalable data platform for our cities and companies of the future. \n\n "}]}, {"time": "11:15 - 12:15", "activities": [{"name_of_activity": "Admin Bouncers: How Endpoint Privilege Management Keeps Your Local Admin Party Exclusive!", "speaker_name": "Jens Du Four", "room_number": "Room 1", "track_label": "Modern Workplace", "url": "https://techorama.be/agenda/session/admin-bouncers-how-endpoint-privilege-management-keeps-your-local-admin-party-exclusive/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "11:15 - 12:15", "description": "This session aims to shed light on the often-overlooked aspect of Endpoint Privilege Management and how it can be used to completely remove the need for local administrators. Join me to explore how Microsoft Endpoint Privilege Management works, some best practices, and demos. At the end you will know how to empower your developers without compromising your security! "}, {"name_of_activity": "Value Objects, objects of great value", "speaker_name": "Raf  Van Baelen", "room_number": "Room 4", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/value-objects-objects-of-great-value/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "11:15 - 12:15", "description": "Have you unlocked the full power of Value Objects in your codebase?\nIn this talk we will do a deep dive into Domain Driven Designs Value Objects. How can they help you transform your code into a richer domain specific language, make it more readable and less error prone.\nWe will explore simple techniques that you can immediately apply to your code when you get home (or during the session if you can't wait).\nLots of samples will be shown so you too can start hunting for Value Objects."}, {"name_of_activity": ".NET Developer Productivity", "speaker_name": "Sam Basu", "room_number": "Room 5", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/net-developer-productivity/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "11:15 - 12:15", "description": "Modern .NET developers have it quite good – mature development frameworks, stable tooling & healthy rich ecosystems. While things can always improve, doesn’t hurt to explore what’s wonderful.\n\n-\tWide platform reach from shared code with .NET MAUI\n-\tBlazor innovations for web & native apps\n-\tPerformant APIs & JS Interop\n-\tAI-powered workflows with GitHub CoPilot\n-\tCross-platform tooling, CodeSpaces & DevBox\n-\tEasy containerization & Cloud services\n\nThis is one of the best times to be a .NET developer – let’s explore why.\n"}, {"name_of_activity": "Practical AI for IT Pros", "speaker_name": "Derek Martin", "room_number": "Room 6", "track_label": "AI & IOT & ML", "url": "https://techorama.be/agenda/session/practical-ai-for-it-pros/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "11:15 - 12:15", "description": "The hype makes AI look pretty amazing, perhaps even mildly scary. Some see it as the new 'developer.' Or a replacement for many roles. But for IT Pros, AI can be the silver bullet to streamlining your workday and empowering your team to achieve more. It's not about taking the place of a Program Manager or Project Manager; it's about using the wealth of knowledge captured throughout your organization to make good decisions faster and present information in a more meaningful way. Join Derek to see how IT Pros within Microsoft are using AI to solve some of our most pressing challenges and making some of the drudgery a bit more fun."}, {"name_of_activity": "Functional Programming with C#", "speaker_name": "Simon Painter", "room_number": "Room 7", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/functional-programming-with-c/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "11:15 - 12:15", "description": "Functional Programming is becoming increasingly popular and relevant with each year that goes by.  With so much discussion around languages such as F#, Haskell and Erlang, it can seem as though getting started with Functional programming would mean first learning a whole new syntax...but what if it didn't?\n\nMost .NET developers are familiar with the use of Linq, and basic constructs such as IEnumerable, Func delegates, arrow functions and ternary expressions, but did you know that you can use all of this to implement some of the most powerful patterns and techniques from the world of functional programming?\n\nThis talk will demonstrate how, using only familiar features available in out-of-the-box C#, to write Functional code that is:\n\n* More robust\n* Easier to read\n* Easier to maintain\n\nAs well as these benefits, Functional code is a great enabler for the use of concurrency with Async functions and Serverless applications with technologies such as Azure Functions.  \n\nThis talk might be of interest to anyone looking into moving to a new platform, or in improving the scalability of an existing application, or even just interested in seeing what Functional Programming is all about, but all within the comfort of a familiar language.  \n\nWe might even attempt the impossible, and explain what a Monad is!"}, {"name_of_activity": "An Introduction to Residuality Theory", "speaker_name": "Barry O'Reilly", "room_number": "Room 8", "track_label": "Architecture", "url": "https://techorama.be/agenda/session/an-introduction-to-residuality-theory/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "11:15 - 12:15", "description": "Residuality theory is a revolutionary new theory of software design that aims to make it easier to design software systems for complex business environments. Residuality theory models software systems as interconnected residues - an alternative to component and process modeling that uses applied complexity science to make managing uncertainty a fundamental part of the design process. "}, {"name_of_activity": "Using Blazor in MAUI", "speaker_name": "Rockford Lhotka", "room_number": "Room 9", "track_label": "Web & Frontend", "url": "https://techorama.be/agenda/session/using-blazor-in-maui/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "11:15 - 12:15", "description": "In this 20 minute talk you will learn how to use MAUI to create native Blazor apps that can be deployed to mobile and desktop scenarios. All the power of Blazor combined with the native capabilities of MAUI are at your fingertips.\n\nLearning points:\n1. Learn how to create a MAUI Blazor project\n2. Learn how Blazor operates within MAUI\n3. Learn how Blazor can leverage MAUI to access native capabilities"}, {"name_of_activity": "Mock your OpenID Connect Provider", "speaker_name": "Kristof Riebbels", "room_number": "Room 10", "track_label": "Security", "url": "https://techorama.be/agenda/session/mock-your-openid-connect-provider/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "11:15 - 12:15", "description": "This session delves into the importance of OpenID Connect in ensuring robust authentication and authorization for APIs. \n\nJoin us for an informative session where we explore the integration of OpenID Connect within the development lifecycle.  \n\nGain insights on how OpenID Connect is configured, how you can mock it to seamlessly integrate OpenID Connect within your CI Pipeline and even test your scopes and policies, without changing your configuration.\n"}, {"name_of_activity": "A Developer's Guide to Surviving Sh*t Project Management", "speaker_name": "Jennifer Wadella", "room_number": "Room 11", "track_label": "Motivational & self-improvement", "url": "https://techorama.be/agenda/session/a-developers-guide-to-surviving-sht-project-management/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "11:15 - 12:15", "description": "Project management is supposed to help us build software more efficiently, so why does it often feel like more of a hinderance? Do we really need SCRUM anyway? This talk is a pragmatic survival guide to help developers on projects with terrible project management. If you've ever been told by a Project Manager you can't do something because \"it will effect the burndown chart\" and yeeting said PM into the sun isn't an option - this talk will provide you efficient work-around strategies so you can spend more time doing what you love - writing code - and less time in frustrating, repetitive, and unproductive meetings."}, {"name_of_activity": "Normalization beyond Third Normal Form", "speaker_name": "Hugo Kornelis", "room_number": "Room 13", "track_label": "Data Platform & BI", "url": "https://techorama.be/agenda/session/normalization-beyond-third-normal-form/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "11:15 - 12:15", "description": "Do you believe the myths that “Third Normal Form is good enough”, or that “Higher Normal Forms are hard to understand”?\nDo you believe the people who claim that these statements are myths?\nOr do you prefer to form your own opinion?\nIf you take database design seriously, you cannot afford to miss this session. You will get a clear and easy to understand overview of all the higher Normal Forms: what they are, how to check if they are met, and what consequences their violations can have. This will arm you with the knowledge to reject the myths about higher Normal Forms. But, more important: it will make you a better designer!"}, {"name_of_activity": "Exploring Azure OpenAI for Responsible AI and Generative Models", "speaker_name": "Michelle Sandford - Developer Engagement Lead @Microsoft", "room_number": "Room 14", "track_label": "AI & IOT & ML", "url": "https://techorama.be/agenda/session/exploring-azure-openai-for-responsible-ai-and-generative-models/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "11:15 - 12:15", "description": "Artificial Intelligence (AI) is changing the way we interact with technology, and with great power comes great responsibility. Businesses are in equal parts excited about the potential to innovate and grow by leveraging this technology, and afraid of losing control of their IP, and their understanding of how their business runs. \n\nIn this session, we will explore the connection between AI, Responsible AI, and text, code, and image generation. We'll talk about the opportunity and the risks and give some advice on how to stay safe while leveraging generative AI.\n\nBy the end of this session, attendees will:\n\n* Understand Azure OpenAI Service and its capabilities\n* Learn about generative AI models\n* Understand responsible AI practices and limited access policies\n"}]}, {"time": "12:15 - 13:15", "activities": [{"name_of_activity": "Lunch", "speaker_name": null, "room_number": null, "track_label": null, "url": null, "day_of_week": "Wednesday", "date": "2024/05/08", "time": "12:15 - 13:15", "description": null}]}, {"time": "12:45 - 13:05", "activities": [{"name_of_activity": "Releasing software to Azure using User Assigned Managed Identity", "speaker_name": "Jerry Van Echelpoel", "room_number": "Room 8", "track_label": "DevOps", "url": "https://techorama.be/agenda/session/releasing-software-to-azure-using-user-assigned-managed-identity/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "12:45 - 13:05", "description": "Setting up a release to Azure requires the necessary infrastructure in Entra ID to be set up. In this session we will see how you can set up a release in Azure DevOps using User Assigned Managed Identity and avoid the set up in Entra ID."}]}, {"time": "13:15 - 14:15", "activities": [{"name_of_activity": "Databricks and Microsoft Fabric - Better Together", "speaker_name": "Wesley Backelant, Ivana Pejeva", "room_number": "Room 1", "track_label": "Data Platform & BI", "url": "https://techorama.be/agenda/session/databricks-and-microsoft-fabric-better-together/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "13:15 - 14:15", "description": "In this session, you will learn how to use Azure Databricks and Microsoft Fabric together to build scalable, reliable, and intelligent data solutions. You will also see how to connect to Microsoft Fabric’s OneLake system, a lakehouse architecture that combines the best of data lakes and data warehouses, to get insights and recommendations from your data. Whether you are a data engineer, a data scientist, or a business analyst, you will discover how Azure Databricks and Microsoft Fabric can help you accelerate your data journey and unlock new possibilities."}, {"name_of_activity": "Building a resilient API landscape with Azure API Management", "speaker_name": "Tom Kerkhove", "room_number": "Room 4", "track_label": "Cloud Services", "url": "https://techorama.be/agenda/session/building-a-resilient-api-landscape-with-azure-api-management/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "13:15 - 14:15", "description": "In the digital age that we live in, we highly depend on cloud services being available that we build upon. However, failure is inevitable and will happen - The question is, will you notice it?\n\nWhen building platforms it is crucial to ensure that you will seamlessly handle failure and by being resilient to them. Come learn how Azure API Management helps you mitigate and recover from failures by using built-in load balancing and circuit-breaking capabilities.\n\nYou will also learn how you can route traffic based on your needs and simulate outages in your API platform to verify your resiliency."}, {"name_of_activity": "EF 8.0, primitive collections and JSON", "speaker_name": "Shay Rojansky", "room_number": "Room 5", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/ef-80-primitive-collections-and-json/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "13:15 - 14:15", "description": "Let's explore one of the major new features of EF Core 8.0 - primitive collections. We'll explore how this feature unlocks whole new categories of LINQ queries for translation, how JSON is used to power those queries, and interesting stories from the journey to make it all possible. Expect interesting deep dives and insights in how EF translates your LINQ queries to SQL, and how all that interacts with performance."}, {"name_of_activity": "The Developer's Guide to AI Powered Apps with Semantic Kernel", "speaker_name": "Stijn Castelyns", "room_number": "Room 6", "track_label": "AI & IOT & ML", "url": "https://techorama.be/agenda/session/the-developers-guide-to-ai-powered-apps-with-semantic-kernel/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "13:15 - 14:15", "description": "In the rapidly evolving landscape of artificial intelligence, Microsofts AI orchestration framework Semantic Kernel enables the development of your own AI-driven apps or copilots.\nThis talk delves into the practical implementation of such a copilot, by examining real-world use cases. More concretely, we show how you can create a Chat-GPT-like interface that can query over your data to give qualitative advice as well as how you can allow the AI to execute your own business functionality. Furthermore, the presentation will explore the mechanisms through which your AI copilot’s functionalities can be seamlessly integrated into the Microsoft Copilot ecosystem, from where it can be used by other applications such as Teams.\nThis talk aims to inspire developers with the knowledge and tools to leverage Semantic Kernel for crafting their AI solutions."}, {"name_of_activity": "SEVEN things about API security", "speaker_name": "Philippe De Ryck", "room_number": "Room 8", "track_label": "Security", "url": "https://techorama.be/agenda/session/seven-things-about-api-security/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "13:15 - 14:15", "description": "APIs are everywhere, but API security is a disaster. Stories of API security breaches seem to be just another news cycle away, shining a harsh spotlight on the ease of API abuse and the complexities of robust API security.\n\nIn this session, we use real-world cases to dive into best practices for securing your APIs. We dive into FOUR crucial vulnerabilities highlighted in the OWASP API Security top 10, exposing the areas you need to safeguard against. But we don't stop there. We also bring the threats to life with ONE demo, providing a practical look at how these vulnerabilities can be exploited. Lastly, we'll discuss TWO real-world case studies, where you'll see how even high-profile organizations can fall victim to these weaknesses. At the end of this session, you will have an actionable set of guidelines to assess and improve the security of your own APIs."}, {"name_of_activity": "The Azure Cloud Adoption Framework in the real world", "speaker_name": "Barbara Forbes", "room_number": "Room 9", "track_label": "Architecture", "url": "https://techorama.be/agenda/session/the-azure-cloud-adoption-framework-in-the-real-world/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "13:15 - 14:15", "description": "The Cloud Adoption Framework is a universal way of creating a flexible Azure environment with lots of freedom for developers while still keeping data and resources secure.You set up a standard to make sure all your workloads can find the most efficient implementation in the cloud. Sounds great right? And it is, but real life implementations can pose some challenges. Including the first world problem of too much documentation.\n\nIn this session, we will take a look at what the Cloud Adoption Framework is and how you can make use of it. We will cover all perspectives: The IT manager, the Cloud Platform team and of course the developers who want their own piece of Azure to work with. After that we will discuss the lessons learned from several real world implementations, both in processes and in technical solutions. At the end you will have practical insights to work with your own Azure environment.\n"}, {"name_of_activity": "Reactivity in Angular Applications: Signals vs. Observables", "speaker_name": "Jan-Niklas Wortmann", "room_number": "Room 10", "track_label": "Web & Frontend", "url": "https://techorama.be/agenda/session/reactivity-in-angular-applications-signals-vs-observables/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "13:15 - 14:15", "description": "Observables have been the Angular Community's reactive primitive since Angular 2 was released with a strict dependency on RxJS. However with the release of Angular version 16, a new reactive primitive has been introduced - Signals - leaving many developers wondering how this should impact their reactive workflows. Do Angular developers need multiple reactive primitives? Do developers still need RxJS? When should developers use Signals and when should they use Observables? And most critically, does the introduction of Signals necessitate refactoring an entire code base like with previous AngularJS applications?\nLet’s find it out together, in this talk we will investigate what Angular developers NEED to know about switching to Signals, the differences between Observables and Signals, and provide best practices and patterns for making Angular applications more reactive today and for days to come!"}, {"name_of_activity": "Supply Chain Attacks in the Terraform Registry", "speaker_name": "Kyle Kotowick", "room_number": "Room 11", "track_label": "DevOps", "url": "https://techorama.be/agenda/session/supply-chain-attacks-in-the-terraform-registry/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "13:15 - 14:15", "description": "Terraform has quickly become one of the most popular IaC tools, gaining a large community that develops and maintains thousands of reusable open-source modules. Modules are one of the core features of Terraform and support rapid infrastructure configuration.\n\nMost users utilize the Terraform Registry for retrieving modules. Unfortunately, the registry is woefully insecure to supply chain attacks, allowing any module author to modify the module's files without changing the module's version in the registry. This talk provides a live demonstration of how module authors can utilize this attack vector to retrieve sensitive data about your infrastructure or make malicious modifications. We review the options for defending against these attacks along with their strengths and weaknesses."}, {"name_of_activity": "Becoming a Better Communicator", "speaker_name": "Jason Alba", "room_number": "Room 13", "track_label": "Motivational & self-improvement", "url": "https://techorama.be/agenda/session/becoming-a-better-communicator/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "13:15 - 14:15", "description": "Every technologist hears that \"soft skills are so important,\" but what does that mean for you? What soft skills should you work on and where do you start? In this session, Jason Alba will talk about one of the most important soft skills tech leaders want from their team: better communication. \n\nJason will talk about critical elements of communication. He'll talk about the negative stereotype technologists have to work against, that of being poor communicators, and how. He'll talk about common pitfalls too many technologists fall in, and how to improve listening skills.\n\nCome learn how to improve how others perceive you, and perhaps attract new opportunities, by enhancing your communication skills.\n\n"}, {"name_of_activity": "Let’s Write a Useful GitHub Action with .NET, Copilot, and the Brand New Octokit SDK", "speaker_name": "Jon Galloway", "room_number": "Room 14", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/lets-write-a-useful-github-action-with-net-copilot-and-the-brand-new-octokit-sdk/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "13:15 - 14:15", "description": "GitHub Actions is a powerful tool for automating workflows and building custom software development tools. We use them a lot on the .NET team at Microsoft, including validation and automation for pull requests on the .NET blog. In this presentation, we will explore how to write a useful GitHub Action using .NET, Copilot and the brand new Octokit SDK (built with Kiota). We'll live code an action, using Copilot to get around some of the quirks of both GitHub Actions and Octokit. I'll share some lessons I learned the hard way and show you how you can start automating your pull request workflow with C# code."}]}, {"time": "14:15 - 14:30", "activities": [{"name_of_activity": "Break", "speaker_name": null, "room_number": null, "track_label": null, "url": null, "day_of_week": "Wednesday", "date": "2024/05/08", "time": "14:15 - 14:30", "description": null}]}, {"time": "14:30 - 15:30", "activities": [{"name_of_activity": "Collapsing Clouds of Dust - The Skunk Works Approach to Cultivating a Software-driven Organization", "speaker_name": "Tobias Mohr, Marlene Roth", "room_number": "Room 1", "track_label": "Modern Workplace", "url": "https://techorama.be/agenda/session/collapsing-clouds-of-dust-the-skunk-works-approach-to-cultivating-a-softwaredriven-organization/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "14:30 - 15:30", "description": "In the era of Digital Transformation, IT departments face the delicate task of upholding their traditional purpose while shaping tomorrow’s value proposition. Navigating through uncertainty, ambiguity, and complexity requires non-tech-native organizations to foster flexibility and speed by undergoing a fundamental shift in their culture and capabilities.\n\nAs most organizations do not share the privilege of launching on a green field, they grapple with complex big balls of mud and discouraging clouds of dust. The real challenge lies in transforming these legacy landscapes full of tech debt, unintentional easter eggs and intertwined interfaces. Thanks to tight coupling, it feels like playing Jenga. You touch one brick and are pretty lucky if you do not wreck the whole complex. \n\nHow do you find the ideal split between: \n- bulletproof architectures and trendy architectural patterns\n- proficient functional silos and refreshing cross-functionality\n- meticulous estimation and daring experimentation \n- saving money and beating the speed of light \n- dealing with tech debt on the verge of bankruptcy and driving innovation\n- upskilling and fishing for new tech talent \n\nUnveiling the path towards making software engineering a cutting-edge capability of our organization we leak our amusing mistakes, unexpected insights, and pragmatic approaches."}, {"name_of_activity": ".NET in a Box: Containerizing .NET Applications", "speaker_name": "Chris Ayers", "room_number": "Room 4", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/net-in-a-box-containerizing-net-applications/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "14:30 - 15:30", "description": "The rapid rise of microservices and cloud-native applications underscores a pressing opportunity for developers: achieving seamless scalability, portability, and amazing efficiency for .NET applications. \n\nIn this session, participants will be taken on a journey into the heart of containerizing .NET applications. From understanding the core tenets of container orchestration to discovering the secrets of achieving peak application performance within a container, this talk is a deep dive into the world of .NET and containers. We'll also touch upon ensuring top-notch security in a containerized ecosystem, and how to best leverage tools and technologies to supercharge your .NET container deployment.\n\nDon't miss this opportunity to redefine your .NET development paradigm. Join us and be part of the container revolution, ensuring your .NET applications are future-ready!\n"}, {"name_of_activity": "Be Ready: Optimizing Cold Start with .NET 8.0 in the Cloud", "speaker_name": "Ian Griffiths", "room_number": "Room 5", "track_label": "Cloud Services", "url": "https://techorama.be/agenda/session/be-ready-optimizing-cold-start-with-net-80-in-the-cloud/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "14:30 - 15:30", "description": "Cloud providers offer a wide range of options for hosting .NET based web services including containers as a service, hosted Kubernetes, Service Fabric, or platforms such as Azure Functions and AWS Lambda. .NET 8.0 has made significant improvements with performance in general, but while throughput and response time get a lot of attention, it has also made significant strides with cold start times, which are hugely important, and often much harder to analyse. In this talk, you'll learn how to ensure your services are ready to leap into action as quickly as possible."}, {"name_of_activity": "Integrating AI in Testing: Challenges and Opportunities", "speaker_name": "Roxane Van Overloop", "room_number": "Room 6", "track_label": "AI & IOT & ML", "url": "https://techorama.be/agenda/session/integrating-ai-in-testing-challenges-and-opportunities/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "14:30 - 15:30", "description": "We want to present an informative and thought-provoking session on the current state of AI testing. We will explore the existing AI testing tools and their capabilities by demo, including the use of ChatGPT for test plan creation and upcoming tools like Quacks AI. Our discussion will provide insights into the effectiveness of AI in testing and identify areas where the technology still needs to evolve. Ultimately, we aim to answer the question on many testers' minds: should we be afraid of being replaced by AI or can we continue to bring value to the testing process?\n"}, {"name_of_activity": "Beyond simple benchmarks—A practical guide to optimizing code", "speaker_name": "Daniel Marbach", "room_number": "Room 7", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/beyond-simple-benchmarksa-practical-guide-to-optimizing-code/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "14:30 - 15:30", "description": "We know it’s vital that code executed at scale performs well. But how do we know if our performance optimizations actually make it faster? Fortunately, we have powerful tools which help—BenchmarkDotNet is a .NET library for benchmarking optimizations, with many simple examples to help get started.\n\nIn most systems, the code we need to optimize is rarely straightforward. It contains assumptions we need to discover before we even know what to improve. The code is hard to isolate. It has dependencies, which may or may not be relevant to optimization. And even when we’ve decided what to optimize, it’s hard to reliably benchmark the before and after. Only measurements can tell us if our changes actually make things faster. Without them, we could even make things slower, without realizing.\n\nUnderstanding how to create benchmarks is the tip of the iceberg. In this talk, you'll also learn how to:\n* Identify areas of improvement which optimize the effort-to-value ratio\n* Isolate code to make its performance measurable without extensive refactoring\n* Apply the performance loop of measuring, changing and validating to ensure performance actually improves and nothing breaks\n* Gradually become more “performance aware” without costing an arm and a leg"}, {"name_of_activity": "The Long Lost Art of Refactoring", "speaker_name": "Jimmy Bogard", "room_number": "Room 8", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/the-long-lost-art-of-refactoring/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "14:30 - 15:30", "description": "The architecture was planned perfectly for the new system. All code would fit neatly into a slice and a layer. Sure this time we would not fall back into a big ball of mud! Fast forward some time, and we still ended up with (smaller) balls of mud. The developers are still complaining that the code is confusing, hard to understand, and hard to maintain. What went wrong?\n\nIn this session we'll rediscover the long lost art of recognizing code smells and applying various refactoring techniques. We'll also look at more complex refactorings that leverage modern tools such as generics and dependency injection. Finally, we'll see how to balance up-front design with emergent design to avoid big balls of mud over the lifetime of a system.\n\n"}, {"name_of_activity": "A Trip Down Memory(Of T) Lane", "speaker_name": "Lander Verhack", "room_number": "Room 9", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/a-trip-down-memoryof-t-lane/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "14:30 - 15:30", "description": "In this session we'll talk about how to write blazing fast and memory-efficient low-level code. We will take a look at various techniques from unmanaged code, struct layouts, pinning memory, Span(Of T) and of course Memory(Of T). Don't assume newer is better and beware of pitfalls."}, {"name_of_activity": "How To Not Strangle Your Coworkers: Resolving Conflict with Collaboration", "speaker_name": "Arthur Doler", "room_number": "Room 10", "track_label": "Motivational & self-improvement", "url": "https://techorama.be/agenda/session/how-to-not-strangle-your-coworkers-resolving-conflict-with-collaboration/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "14:30 - 15:30", "description": "Conflict at work is as inevitable as the tides - like the old joke says, if you put five software engineers in a room, you’ll have seven opinions. Whether the conflict is over what language to use, what frameworks are the new hotness, or even just tabs vs spaces, conflict can get ugly. Tempers flare, positions are staked out in absolute terms, feelings are hurt, working relationships are destroyed… if only there were a way to avoid the negative consequences.\n\nWhat if I told you that there is? Let’s take a journey together towards a wholly different approach to conflict - a collaborative one. In this talk, you’ll learn how to use conflict to fuel better software, better teams, and better companies. You’ll learn how to structure your team’s environment to draw out good conflict, to squelch the bad conflict, and to handle conflict when it becomes personal. We’ll discuss how to manage different confrontational styles, avoid self-sealing prophecies, and even how to deal with conflict when you lack control. Conflict should fuel your progress, not hinder it - and after this talk, you can make that happen."}, {"name_of_activity": "The top 10 mistakes made while moving to Azure.", "speaker_name": "Dieter Wijckmans", "room_number": "Room 11", "track_label": "Cloud Services", "url": "https://techorama.be/agenda/session/the-top-10-mistakes-made-while-moving-to-azure/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "14:30 - 15:30", "description": "Moving to the cloud is not straight forward. A lot of mistakes are made when migrating to Azure, from inadequate planning to security oversights. Learn how to address data migration challenges, manage application dependencies, and optimize cost analysis. A lot of companies start without proper preparation and see their cloud journey slowed down or even worse. Join this session to identify the most common mistakes upfront so you can plan to avoid them and succeed in your cloud projects."}, {"name_of_activity": "Confidential development with Always Encrypted using enclaves", "speaker_name": "Pieter Vanhove", "room_number": "Room 13", "track_label": "Data Platform & BI", "url": "https://techorama.be/agenda/session/confidential-development-with-always-encrypted-using-enclaves/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "14:30 - 15:30", "description": "Always Encrypted is a client-side encryption technology that ensures sensitive data (and related encryption keys) are never revealed to the SQL Server or Azure SQL Database. With Always Encrypted, a client driver transparently encrypts sensitive data before passing the data to the Database Engine, and it transparently decrypts data retrieved from encrypted database columns. Developing applications that use Always Encrypted protected databases requires some special attention, such as using parameterized queries and collations. Join us for this session to learn about this game-changing technology. We will demonstrate the main benefits of Always Encrypted with secure enclaves, discuss the best practices for developing your application the right way, and address the latest Always Encrypted investments in Azure SQL."}, {"name_of_activity": "Clean as you Code: use Sonar and Roslyn analyzers to focus on the code you modify", "speaker_name": "Andrei Epure", "room_number": "Room 14", "track_label": "DevOps", "url": "https://techorama.be/agenda/session/clean-as-you-code-use-sonar-and-roslyn-analyzers-to-focus-on-the-code-you-modify/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "14:30 - 15:30", "description": "Clean code is crucial for ensuring the maintainability and scalability of software projects. However, it can be challenging for developers to improve the code quality of legacy codebases.\n\nIn this session, Andrei will introduce the Clean as You Code approach, which empowers developers to take ownership of their code and meet high-quality standards. Using the open-source tools SonarQube and SonarLint and various open-source Roslyn analyzers, developers and teams can focus on the code they modify and ensure that it adheres to Clean Code standards. \n\nBy adopting this low-effort approach, developers can quickly identify and fix code issues, resulting in a cleaner codebase and improved software quality. Over time, by cleaning the code you modify, you enhance the quality of the overall code and achieve a more maintainable, reliable, secure, scalable, and high-quality codebase."}]}, {"time": "15:30 - 16:00", "activities": [{"name_of_activity": "Break", "speaker_name": null, "room_number": null, "track_label": null, "url": null, "day_of_week": "Wednesday", "date": "2024/05/08", "time": "15:30 - 16:00", "description": null}]}, {"time": "16:00 - 17:00", "activities": [{"name_of_activity": "Forecasting Cyber Weather: Discover Cybersecurity storms with Microsoft Defender Threat Intelligence", "speaker_name": "Ronny de Jong, Pim Jacobs", "room_number": "Room 1", "track_label": "Security", "url": "https://techorama.be/agenda/session/forecasting-cyber-weather-discover-cybersecurity-storms-with-microsoft-defender-threat-intelligence/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "16:00 - 17:00", "description": "In this engaging session, we invite you to explore the power of Microsoft Defender Threat Intelligence (MDTI) as your cybersecurity weather radar. Learn how to enhance your data sets with the use of threat intelligence, empowering you to make informed decisions and stay ahead of potential storms. And lastly, explore the role of brand-intelligence in identifying and mitigating risks to your organization's reputation.\n\nDive into the process of URL detonation and witness firsthand how MDTI analyzes and dissects suspicious URLs, preventing potential cyber hurricanes before they make landfall. Delve into Sentinel incident enrichment via the MDTI API and use of playbooks, uncovering the secrets to orchestrating a robust response to cyber threats.\n\nJoin us as we decode the cybersecurity weather forecast with Microsoft Defender Threat Intelligence, arming you with the tools and insights needed to - ultimo avoid - or become resilient against storms in the digital realm. Don't miss this opportunity to fortify your cybersecurity strategy and ensure a clear sky ahead in the ever-evolving threat landscape."}, {"name_of_activity": "Azure accidents and how to avoid them", "speaker_name": "Rik Hepworth", "room_number": "Room 4", "track_label": "Cloud Services", "url": "https://techorama.be/agenda/session/azure-accidents-and-how-to-avoid-them/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "16:00 - 17:00", "description": "I’ve seen things you people wouldn’t believe: Production applications running on dev-tier services with no SLA; internet-facing APIs with no security; waiting for the billing apocalypse.\nIn this session we’ll use real word examples to discuss the painful situations organisations can find themselves in, how they were resolved and how they might have been avoided."}, {"name_of_activity": "How we achieved extreme scale under the hood in Azure Functions", "speaker_name": "Paul Yuknewicz", "room_number": "Room 5", "track_label": "Cloud Services", "url": "https://techorama.be/agenda/session/how-we-achieved-extreme-scale-under-the-hood-in-azure-functions/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "16:00 - 17:00", "description": "In this session we’ll take a deep dive under the hood of Azure Functions to see how we achieve ultra high scale levels, e.g. burst scaling out to 1000 instance under a minute, or processing 10’s of 1000s of events/requests per second, or keeping those cold start times small.  Will do this with an eye to how you can leverage several techniques with your own.  Fasten your seatbelts!  \n"}, {"name_of_activity": "Getting started with SparkML in Microsoft Fabric", "speaker_name": "Nico Jacobs", "room_number": "Room 6", "track_label": "AI & IOT & ML", "url": "https://techorama.be/agenda/session/getting-started-with-sparkml-in-microsoft-fabric/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "16:00 - 17:00", "description": "SparkML (aka MLlib) is a library for machine learning on the Spark framework. Crucial is the concept of Transformers and Estimators, with which parameterized pipelines can be built.\nIn this session you will see how to start building machine learning pipelines in Microsoft Fabric notebooks using MLlib, train a machine learning model and see the resulting model being used to make predictions."}, {"name_of_activity": "The Hero’s Journey: a guide to scaling Copilot in the Enterprise", "speaker_name": "Colin Dembovsky", "room_number": "Room 7", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/the-heros-journey-a-guide-to-scaling-copilot-in-the-enterprise/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "16:00 - 17:00", "description": "The Hero's Journey is a storytelling pattern that has been used for centuries in literature and mythology. This framework is seen in almost every successful story - from the Odyssey to Lord of the Rings and even Harry Potter.\nGitHub Copilot is the world's most successful AI pair programmer, boosting individual productivity at the task level. However, rolling out GitHub Copilot at scale in the Enterprise can be challenging. How do successful organizations realize enterprise gains with GitHub Copilot?\nIn this session, Colin covers what the Hero's Journey is and how we can use this journey to create a framework for rolling out GitHub Copilot at scale."}, {"name_of_activity": "25 years of C#", "speaker_name": "Bart De Smet", "room_number": "Room 8", "track_label": "Developer Trends", "url": "https://techorama.be/agenda/session/25-years-of-c/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "16:00 - 17:00", "description": "Join me in celebrating C#'s 25th anniversary with a whirlwind tour through its history starting from its original design in 1999 as \"project Cool\" all the way to 2024.\n\nIn this session, we'll reflect on the original design goals of the language, get to know some anecdotes and tidbits, and have a critical look at how various language features stood the test of time.\n\nWe'll also look forward at the future of C# and talk about how the design team thinks about language evolution."}, {"name_of_activity": "Building Real-time Streaming Web UIs with Blazor and Akka.NET", "speaker_name": "Aaron Stannard", "room_number": "Room 9", "track_label": "Web & Frontend", "url": "https://techorama.be/agenda/session/building-realtime-streaming-web-uis-with-blazor-and-akkanet/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "16:00 - 17:00", "description": "When it comes to real-time Web UIs, the possibilities are endless for .NET users: \n\n* A live dashboard? \n* Multi-player games?\n* Live chat?\n* Collaboration tools?\n* Video and audio streaming?\n\nAnd more! In this talk we're going to present on how we can use Akka.NET and Blazor to build scalable, streaming web applications without JavaScript or any fuss. Pure C# end to end."}, {"name_of_activity": "Uptime & beyond: Mastering SRE with advanced service quality metrics", "speaker_name": "Dimitar Popov", "room_number": "Room 10", "track_label": "DevOps", "url": "https://techorama.be/agenda/session/uptime-beyond-mastering-sre-with-advanced-service-quality-metrics/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "16:00 - 17:00", "description": "Have you ever wondered why, despite your best efforts, service outages still keep your team in firefighting mode, costing not just hours but opportunities for innovation? Studies show that developers spend on average 30-50% of their time addressing stability issues rather than building new features.\n\nThis session aims to change that narrative by highlighting how traditional binary indicators of \"up\" or \"down\" fall short in providing the full picture of service health.\n\nWe propose a shift towards Site Reliability Engineering (SRE) principles, focusing on granular service quality metrics such as SLOs and SLAs. By exploring practical implementation strategies applicable from individual applications to comprehensive enterprise systems, illustrated with real-world examples, we'll showcase how tools like Datadog can revolutionize the developer experience.\n\nThis paradigm shift enables developers to prioritize innovation over maintenance, fundamentally enhancing both reliability and the quality of digital services. Join us to integrate essential SRE concepts into your workflow, elevating your organization's operational excellence."}, {"name_of_activity": "Turbocharged SQL: Indexing Techniques for the Fast Lane!", "speaker_name": "Pinal Dave", "room_number": "Room 11", "track_label": "Data Platform & BI", "url": "https://techorama.be/agenda/session/turbocharged-sql-indexing-techniques-for-the-fast-lane/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "16:00 - 17:00", "description": "Unleash the Full Power of Your SQL Server: Turbocharge Your Queries!\n\nAre you tired of watching the clock tick while your SQL Server crawls through data? Before you point fingers at SQL Server's performance, take a closer look at your code. The root of sluggish queries often lies not in the server itself but in how those queries are crafted and how wisely indexes have been wielded.\n\nJoin us for an engaging session that dives deep into the heart of SQL Server performance issues. Discover innovative techniques to diagnose the bottlenecks that throttle your database speed and learn the indexing strategies that will send your queries flying like never before!\n\nBy the time you leave, you'll be armed with actionable scripts and cutting-edge insights that you can deploy on your servers when you walk out the door. Say goodbye to slow queries and hello to peak performance with your SQL Server!"}, {"name_of_activity": "Consuming GraphQL using C#", "speaker_name": "Brandon Minnick", "room_number": "Room 13", "track_label": "Web & Frontend", "url": "https://techorama.be/agenda/session/consuming-graphql-using-c/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "16:00 - 17:00", "description": "GraphQL has become a staple technology in the JavaScript community, but it is still relatively new and unknown in the C# world.\n\nJoin me as we explore the GraphQL tools available for .NET developers, like HotChocolate + Strawberry Shake, and how these tools make it easy to consume GraphQL APIs in C#!"}, {"name_of_activity": "Taming the Microsoft Graph for the IT Pro", "speaker_name": "Todd Klindt", "room_number": "Room 14", "track_label": "Modern Workplace", "url": "https://techorama.be/agenda/session/taming-the-microsoft-graph-for-the-it-pro/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "16:00 - 17:00", "description": "The Microsoft Graph is a powerful tool for IT professionals to manage and automate tasks across various Microsoft products and services. However, its vast capabilities can be overwhelming for those new to the platform. In this session Todd will provide an overview of the Microsoft Graph, including its capabilities and use cases, and offer tips and best practices for taming its complexity. Attendees will learn how to effectively utilize the Graph to automate tasks, manage user data, and integrate with other tools and services. Attendees will learn how to use PowerShell, a powerful scripting language, to automate tasks and manage data in the Graph. We will also cover the Graph Explorer, a web-based tool that allows users to interact with the Graph and test out different queries and commands. By the end of the talk, attendees will have a solid understanding of the Microsoft Graph and be equipped to use it to streamline their IT operations."}]}, {"time": "17:00 - 17:15", "activities": [{"name_of_activity": "Break", "speaker_name": null, "room_number": null, "track_label": null, "url": null, "day_of_week": "Wednesday", "date": "2024/05/08", "time": "17:00 - 17:15", "description": null}]}, {"time": "17:15 - 18:15", "activities": [{"name_of_activity": "Closing Magic Show by Gili (Overflow 1)", "speaker_name": "Gili The Comedian - Mentalist", "room_number": "Room 5", "track_label": "Motivational & self-improvement", "url": "https://techorama.be/agenda/session/closing-magic-show-by-gili-overflow-1/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "17:15 - 18:15", "description": "\nComedian-Mentalist Gili (aka Lieven Gheysen) surprises friend and foe alike by using his five senses so well that it seems as if he has a sixth sense. This is the skill that mentalist Gili has elevated to a true art form, and with which he lovingly mocks alleged psychics and clairvoyants. Mentalism, humor, science, illusionism, ventriloquism,... but also subtle lies and honest deception: Anyone who has ever seen comedian-mentalist Gili perform knows that this man cannot be pinned down to just one craft. His shows are like a symphony of all these elements, and the audience gladly gets carried away."}, {"name_of_activity": "Closing Magic Show by Gili (Overflow 2)", "speaker_name": "Gili The Comedian - Mentalist", "room_number": "Room 6", "track_label": "Motivational & self-improvement", "url": "https://techorama.be/agenda/session/closing-magic-show-by-gili-overflow-2/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "17:15 - 18:15", "description": "\nComedian-Mentalist Gili (aka Lieven Gheysen) surprises friend and foe alike by using his five senses so well that it seems as if he has a sixth sense. This is the skill that mentalist Gili has elevated to a true art form, and with which he lovingly mocks alleged psychics and clairvoyants. Mentalism, humor, science, illusionism, ventriloquism,... but also subtle lies and honest deception: Anyone who has ever seen comedian-mentalist Gili perform knows that this man cannot be pinned down to just one craft. His shows are like a symphony of all these elements, and the audience gladly gets carried away."}, {"name_of_activity": "Closing Magic Show by Gili", "speaker_name": "Gili The Comedian - Mentalist", "room_number": "Room 8", "track_label": "Motivational & self-improvement", "url": "https://techorama.be/agenda/session/closing-magic-show-by-gili/", "day_of_week": "Wednesday", "date": "2024/05/08", "time": "17:15 - 18:15", "description": "\nComedian-Mentalist Gili (aka Lieven Gheysen) surprises friend and foe alike by using his five senses so well that it seems as if he has a sixth sense. This is the skill that mentalist Gili has elevated to a true art form, and with which he lovingly mocks alleged psychics and clairvoyants. Mentalism, humor, science, illusionism, ventriloquism,... but also subtle lies and honest deception: Anyone who has ever seen comedian-mentalist Gili perform knows that this man cannot be pinned down to just one craft. His shows are like a symphony of all these elements, and the audience gladly gets carried away."}]}, {"time": "18:15 - 20:30", "activities": [{"name_of_activity": "Closing reception and Prize Draw", "speaker_name": null, "room_number": null, "track_label": null, "url": null, "day_of_week": "Wednesday", "date": "2024/05/08", "time": "18:15 - 20:30", "description": null}]}]